MiEcosystem/mijia_ble_api/cc26xx_api.c
/******************************************************************************

 @file  cc26xx_api.c

 @brief porting layer for the MiBLE API, for the CC26XX familly devices of TI.

 Group: WCS, BTS
 Target Device: cc13x2_26x2

 ******************************************************************************
 
 Copyright (c) 2018-2019, Texas Instruments Incorporated
 All rights reserved.

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:

 *  Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.

 *  Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.

 *  Neither the name of Texas Instruments Incorporated nor the names of
    its contributors may be used to endorse or promote products derived
    from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

 ******************************************************************************
 
 
 *****************************************************************************/

/*********************************************************************
 * INCLUDES
 */
#include "mible_type.h"
#include "bcomdef.h"
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/knl/Event.h>
#include <ti/sysbios/knl/Clock.h>

#include "mible_log.h"
#include "mible_api.h"

#include "icall_ble_api.h"

#include <portable/cc26xx_api.h>
#include <common/cc26xx/util.h>
#ifdef CC26X2
#include <services/src/nv/cc26xx/nvoctp.h>
#include <ti/drivers/AESECB.h>
#include <ti/drivers/cryptoutils/cryptokey/CryptoKeyPlaintext.h>
#else  // CC26x2
#include <services/src/nv/cc26xx/nvocop.h>
#include <ti/drivers/crypto/CryptoCC26XX.h>
#endif  // CC26x2

#include "TRNGCC26XX.h"

/*********************************************************************
 * MACROS
 */

#define GATT_PRIMARY_SERVICE(data)  \
{                                   \
  .type =                           \
  {                                 \
    .len  = ATT_BT_UUID_SIZE,       \
    .uuid = primaryServiceUUID      \
  },                                \
  .permissions = GATT_PERMIT_READ,  \
  .handle = 0,                      \
  .pValue = data                    \
}

#define GATT_CHAR_ATTR(data)        \
{                                   \
  .type =                           \
  {                                 \
    .len  = ATT_BT_UUID_SIZE,       \
    .uuid = characterUUID           \
  },                                \
  .permissions = GATT_PERMIT_READ,  \
  .handle = 0,                      \
  .pValue = data                    \
}


#define GATT_CCC_ATTRIB(data)       \
{                                   \
  .type =                           \
  {                                 \
    .len  = ATT_BT_UUID_SIZE,       \
    .uuid = clientCharCfgUUID       \
  },                                \
  .permissions = GATT_PERMIT_READ | GATT_PERMIT_WRITE, \
  .handle = 0,                      \
  .pValue = (uint8 *) data                    \
}

#define GATT_CHAR_FORMAT_ATTRIB(data)       \
{                                   \
  .type =                           \
  {                                 \
    .len  = ATT_BT_UUID_SIZE,       \
    .uuid = charFormatUUID          \
  },                                \
  .permissions = GATT_PERMIT_READ,  \
  .handle = 0,                      \
  .pValue = (uint8 *) data          \
}

#define GATT_CHAR_EXT_PROP_ATTRIB(data)       \
{                                   \
  .type =                           \
  {                                 \
    .len  = ATT_BT_UUID_SIZE,       \
    .uuid = charExtPropsUUID        \
  },                                \
  .permissions = GATT_PERMIT_READ,  \
  .handle = 0,                      \
  .pValue = (uint8 *) data          \
}

#define GATT_CHAR_USER_DESC_ATTRIB(data)       \
{                                   \
  .type =                           \
  {                                 \
    .len  = ATT_BT_UUID_SIZE,       \
    .uuid = charUserDescUUID        \
  },                                \
  .permissions = GATT_PERMIT_READ,  \
  .handle = 0,                      \
  .pValue = (uint8 *) data          \
}

#define GATT_CHAR_VALUE_ATTRIB(lenght, char_uuid, permission, data)        \
{                                   \
  .type =                           \
  {                                 \
    .len  = lenght,                 \
    .uuid = char_uuid               \
  },                                \
  .permissions = permission,        \
  .handle = 0,                      \
  .pValue = data                    \
}

#define STATUS_CHECK(status) {                      \
  if (status != SUCCESS)                            \
  {                                                 \
    MIBLE_PORT_ASSERT(!status);                     \
    MIBLE_PORT_LOG_WAR1("Failure...%d", status);    \
    return(status);                                 \
  }                                                 \
}

const static uint8_t advertDataDefault[] =
{
    0x02, // length of this data
    GAP_ADTYPE_FLAGS,
    GAP_ADTYPE_FLAGS_GENERAL | GAP_ADTYPE_FLAGS_BREDR_NOT_SUPPORTED
};

