MiEcosystem/mijia_ble_api/cc26xx_api.c
#define NOT_MANAGE_AT_THIS_TIME 0
#define YOU_NEED_TO_ENABLE_AUTHORIZATION_FEATURE 0
/*********************************************************************
 * CONSTANTS
 */

#define MIBLE_UUID_16           0
#define MIBLE_UUID_128          1

#define MIBLE_TASK_Q_EVENT      0xFFFF /* dummy event */

#define MIBLE_SYSTEM            (NVINTF_SYSID_APP+1)

#define MIBLE_NV_RECORD_MAX_SIZE 64
/*********************************************************************
 * TYPEDEFS
 */

//! \brief structure to store the state of an ATT operation.
// per specification, only one ATT req can be active at a time (except for
// ATT WRITE CMD and NOTIFICATION
typedef struct _ATToperation_s
{
  struct _flag_s {
    uint8_t validity : 1;           //!< indicate an ongoing ATT operation.
    uint8_t authorNeeded : 1;       //!< indicate if an ongoing ATT operation requires authorization.
    uint8_t safe_to_dealloc: 1;
  } flag;
  uint8_t          method;          //!< method of the ongoing ATT operation.
  uint16_t         maxLen;          //!< max length of data for this ATT operation.
  uint16_t         maxCharValueLen; //!< Max size of Characteristic Value
  uint16_t         connHandle;      //!< handle of the connection the ATT operation is done for
  gattAttribute_t  *pAttr;          //!< pointer to the attribute the ATT operation is perform on
  uint16_t         offset;          //!< offset of the value to perform the read/write operation
  uint8_t          *pValue;         //!< pointer to the data for the ATT operation
}ATToperation_t;


//! \brief structure to store all characterisitc value parameters for a specific service.
typedef struct _qServiceRec_s
{
  Queue_Elem      _elem;          //!< element information
  gattAttribute_t *pAttrSrvTbl;   //!< pointer to the attribute table for this service
  Queue_Struct    charValueQ;     //!< Structure of the characteristic value queue for this service
  Queue_Handle    charValueQHdl;  //!< Handle of the characteristic value queue for this service
} qServiceRec_t;

//! \brief structure for storing parameters of a specific characteristic.
typedef struct _qCharValueRec_s
{
  Queue_Elem _elem;               //!< element information
  struct _flag2_s {
    uint8_t is_variable_len : 1;  //!< indicate this characteristic value has a variable length
    uint8_t rd_author : 1;        //!< indicate this characteristic value requires read authorization
    uint8_t wr_author : 1;        //!< indicate this characteristic value requires write authorization
  } flag;
  uint8_t         len;            //!< actual length of the characteristic value
  uint8_t         maxLen;         //!< maximum length of the characteristic value (if variable length characteristic value)
  uint16_t        handle;         //!< handle of the characteristic value
  gattAttribute_t *pAttr;         //!< attribute of the charaxteristic value
  gattCharCfg_t   *pCCCValue;     //!< Characteristic client configuration for this characteristic value.
} qCharValueRec_t;

//! \brief structure containing all parameters of the porting layer.
struct port_object_s
{
  uint8_t                 advHandle;     //!< Advertising set handle
  uint8_t                 *advPayload;   //!< Advertising set payload pointer
  uint8_t                 *advSrPayload; //!< Advertising set scan response payload pointer
  ATToperation_t          ATTop;         //!< structure for ATT operation
  mible_port_cb_t         callbacks;     //!< structure for porting layer callback
  Queue_Struct            taskQ;         //!< Queue structure for task
  Queue_Handle            taskQHdl;      //!< Queue handle for task
  Queue_Struct            serviceQ;      //!< Queue structure for Service
  Queue_Handle            serviceQHdl;   //!< Queue handle for Service
  Event_Handle            appSync;       //!< Sync Object to wake up the application thread
  uint8_t                 taskId;        //!< iCall taskid (used for indication confirmation)
  NVINTF_nvFuncts_t       NVpfn;         //!< Structure for NV driver function pointer
};

//! \brief structure for Timer objects
typedef struct
{
  Clock_Struct clock;       //!< Clock object for timer
  mible_timer_handler cb;   //!< callback that will be called when clock expired.
  void *arg;                //!< argument pass to the callback.
}timer_t;


//! \brief structure for GATT event.
typedef struct
{
    mible_gatts_evt_t evt;                //!< event triggered
    mible_gatts_evt_param_t gattsParams;  //!< parameter of the GATT event
}gatt_event_t;

//! \brief structure for task.
typedef struct _qTaskRec_s
{
  Queue_Elem      _elem;          //!< element  (private)
  mible_handler_t handler;        //!< handler, will be call when the task execute
  void            *arg;           //!< will be pass as an argument to the handler
} qTaskRec_t;

/*********************************************************************
 * GLOBAL VARIABLES
 */

/*********************************************************************
 * LOCAL FUNCTIONS
 */
static bStatus_t miapi_port_ReadAttrCB(uint16_t connHandle,
                                         gattAttribute_t *pAttr,
                                         uint8_t *pValue, uint16_t *pLen,
                                         uint16_t offset, uint16_t maxLen,
                                         uint8_t method);
static bStatus_t miapi_port_WriteAttrCB(uint16_t connHandle,
                                          gattAttribute_t *pAttr,
                                          uint8_t *pValue, uint16_t len,
                                          uint16_t offset, uint8_t method);
static void miapi_port_init (Event_Handle sync, uint8_t taskId);
static void miapi_port_gapEvent (gapEventHdr_t * data);
static void miapi_port_gattEvent (gattMsgEvent_t * data);
static void miapi_port_stackEvent (uint8_t stackEventCat , void * data);
static void miapi_port_advReport( void *pData );

// Note: When an operation on a characteristic requires authorization and
// pfnAuthorizeAttrCB is not defined for that characteristic's service, the
// Stack will report a status of ATT_ERR_UNLIKELY to the client.  When an
// operation on a characteristic requires authorization the Stack will call
// pfnAuthorizeAttrCB to check a client's authorization prior to calling
// pfnReadAttrCB or pfnWriteAttrCB, so no checks for authorization need to be
// made within these functions.
CONST gattServiceCBs_t MibleProfileCBs = {
  miapi_port_ReadAttrCB,  // Read callback function pointer
  miapi_port_WriteAttrCB, // Write callback function pointer
  NULL                    // Authorization callback function pointer
};

/*********************************************************************
 * LOCAL VARIABLES
 */
static struct port_object_s port_object =
{
  .advHandle = 0,
  .advPayload = NULL,
  .advSrPayload = NULL,
  .ATTop = {0},
  .callbacks =
  {
    .init = miapi_port_init,
    .stackEvent = miapi_port_stackEvent,
    .taskExec = mible_tasks_exec,
  },
  .taskQ = NULL,
  .taskQHdl = NULL,
  .serviceQ = NULL,
  .serviceQHdl = NULL,
  .appSync = NULL,
  .taskId = INVALID_TASK_ID,
  .NVpfn = NULL,
};

#ifndef CC26X2
static uint16_t NV_bitfield = 0x0000;   // each bit indicate a customer NV record whether assigned
#endif // ! CC26X2

/*********************************************************************
 * FUNCTIONS
 */

void miapi_port_timer_cb(void *arg)
{
  timer_t* timer = (timer_t*) arg;
  mible_task_post(timer->cb, timer->arg);
}

