MiEcosystem/mijia_ble_api/cc26xx_api.c
mible_status_t miapi_port_translateError(uint8_t status)
{
    mible_status_t res = MI_SUCCESS;
    if (status != SUCCESS)                    
    {                                         
      if (status == bleMemAllocError)         
      {                                       
          res = MI_ERR_RESOURCES;
      }                                       
      else if (status == bleInternalError)    
      {                                       
          res = MI_ERR_INVALID_STATE;
      }                                       
      else if (status == INVALIDPARAMETER)    
      {                                       
          res = MI_ERR_INVALID_PARAM;
      }                                       
      else if (status == bleIncorrectMode)    
      {                                       
          res = MI_ERR_INVALID_STATE;
      }                                       
      else if (status == bleNotReady)         
      {                                       
          res = MI_ERR_BUSY;
      }                                       
      else if (status != SUCCESS)             
      {                                       
          res = MI_ERR_BUSY;
      }                                       
      MIBLE_PORT_LOG_WAR1("Status Error  : 0x%x)", status);
    }
    return(res);
} 

static qCharValueRec_t* miapi_port_GattTblFindCharByPtrs(uint8_t *pValue)
{
  qServiceRec_t *elemSer;

  for (elemSer = Queue_head(port_object.serviceQHdl);
       elemSer != (qServiceRec_t *)port_object.serviceQHdl;
       elemSer = Queue_next(&elemSer->_elem))
  {
      qCharValueRec_t *elemChar;

      for (elemChar = Queue_head(elemSer->charValueQHdl);
           elemChar != (qCharValueRec_t *)elemSer->charValueQHdl;
           elemChar = Queue_next(&elemChar->_elem))
      {
         if( elemChar->pAttr->pValue == pValue )
         {
             return(elemChar);
         }
      }
  }
  return(NULL);
}

static bStatus_t miapi_port_SendNotiInd(uint16 connHandle, uint8 cccValue, gattAttribute_t *pAttr, pfnGATTReadAttrCB_t pfnReadAttrCB)
{
  attHandleValueNoti_t noti;
  uint16 len;
  bStatus_t status;

  // If the attribute value is longer than (ATT_MTU - 3) octets, then
  // only the first (ATT_MTU - 3) octets of this attributes value can
  // be sent in a notification.
  noti.pValue = (uint8 *)GATT_bm_alloc(connHandle, ATT_HANDLE_VALUE_NOTI,
                                        GATT_MAX_MTU, &len);
  if (noti.pValue != NULL)
  {
    noti.handle = pAttr->handle;

    status = (*pfnReadAttrCB)( connHandle, pAttr, noti.pValue, &noti.len,
                               0, len, GATT_LOCAL_READ );

    if (cccValue & GATT_CLIENT_CFG_NOTIFY)
    {
      status = GATT_Notification(connHandle, &noti, FALSE);
    }
    else // GATT_CLIENT_CFG_INDICATE
    {
      status = GATT_Indication(connHandle, (attHandleValueInd_t *)&noti,
                               FALSE, port_object.taskId);
    }

    if (status != SUCCESS)
    {
      GATT_bm_free((gattMsg_t *)&noti, ATT_HANDLE_VALUE_NOTI);
    }
  }
  else
  {
    status = bleNoResources;
  }

  return (status);
}

static bStatus_t miapi_port_ReadAttrValue(gattAttribute_t *pAttr,
                                            uint8_t *pValue, uint16_t *pLen,
                                            uint16_t offset, uint16_t maxLen)
{
  // find attribute in the database...
  // GATT server will take care of reading the USER_DESC, CHAR Format UUID, CCC, extended properties, server cfg, ...
  // Other characteristic attribute should not exist based on the service definition limitation of the Xiaomi API.
  // Therefore, only Characteristic value attribute are considered bellow.
  qCharValueRec_t* charValue = miapi_port_GattTblFindCharByPtrs((uint8_t*) pAttr->pValue);
  MIBLE_PORT_ASSERT(charValue);
  if (offset > charValue->len)
  {
    return(ATT_ERR_INVALID_OFFSET);
  }

  uint16_t dataSize = ((charValue->len - offset) > maxLen)? maxLen:(charValue->len - offset);

  VOID memcpy(pValue, pAttr->pValue + offset, dataSize);
  *pLen = dataSize;
  MIBLE_PORT_DBG1("Len Returned: %d", dataSize);
  return(SUCCESS);
}

static void miapi_port_gattTask(void * param)
{
  gatt_event_t *author = (gatt_event_t*)param;
  mible_gatts_event_callback(author->evt, &author->gattsParams);

  // If this is a answer to a write request, the initial buffer that stores 
  // the write request value needs to be freed.
  if (port_object.ATTop.flag.safe_to_dealloc)
  {
    if(port_object.ATTop.pValue)
    {
      BM_free(port_object.ATTop.pValue);
    }
    port_object.ATTop.flag.safe_to_dealloc = 0;
  }
  
  ICall_free(author);
}

/*********************************************************************
 * @fn          miapi_port_ReadAttrCB
 *
 * @brief       Read an attribute.
 *
 * @param       connHandle - connection message was received on
 * @param       pAttr - pointer to attribute
 * @param       pValue - pointer to data to be read
 * @param       pLen - length of data to be read
 * @param       offset - offset of the first octet to be read
 * @param       maxLen - maximum length of data to be read
 * @param       method - type of read message
 *
 * @return      SUCCESS, blePending or Failure
 */
static bStatus_t miapi_port_ReadAttrCB(uint16_t connHandle,
                                       gattAttribute_t *pAttr,
                                       uint8_t *pValue, uint16_t *pLen,
                                       uint16_t offset, uint16_t maxLen,
                                       uint8_t method)
{
    qCharValueRec_t* charValue = miapi_port_GattTblFindCharByPtrs((uint8_t*) pAttr->pValue);
    MIBLE_PORT_ASSERT(charValue);
    MIBLE_PORT_DBG3(": Handle: %d , method: %d, offset: %d, ", pAttr->handle, method, offset);
#ifdef MIAPI_PORT_AUTHORIZATION_FTR
    // Check is it requires authorization//
    if (charValue->flag.rd_author)
    {
        // if yes, return ble_epending and signal it.
        // Store all needed information about the ATT operation...
        // only one ATT operation at teh same time, some method are not supported yet.
        switch(method)
        {
            case ATT_READ_REQ:
            case ATT_READ_BLOB_REQ:
            case ATT_READ_BY_TYPE_REQ:
                MIBLE_PORT_ASSERT(!port_object.ATTop.flag.validity);
                if (port_object.ATTop.flag.validity)
                {
                    return(bleInternalError);
                }
                port_object.ATTop.flag.validity = 1;
                port_object.ATTop.flag.authorNeeded = 1;
                port_object.ATTop.flag.safe_to_dealloc = 0;                
                port_object.ATTop.method = method;
                port_object.ATTop.connHandle = connHandle;
                port_object.ATTop.pAttr = pAttr;
                port_object.ATTop.maxLen = maxLen;
                port_object.ATTop.offset = offset;
                // stack a tasklet to call the callback in a different context...
                {
                  gatt_event_t* author = ICall_mallocLimited(sizeof(gatt_event_t));
                  MIBLE_PORT_ASSERT(author);
                  if(!author) return(bleNoResources);
                  author->evt = MIBLE_GATTS_EVT_READ_PERMIT_REQ;
                  author->gattsParams.conn_handle = connHandle;
                  author->gattsParams.read.value_handle = pAttr->handle;
                  mible_status_t status = mible_task_post(miapi_port_gattTask, author);
                  MIBLE_PORT_ASSERT(status==MI_SUCCESS);
                  if(MI_SUCCESS != status)
                  {
                    ICall_free(author);
                    return(bleNoResources);
                  }
                }
                return(blePending);
            case ATT_READ_BY_GRP_TYPE_REQ:
            default:
                MIBLE_PORT_LOG_WAR1("this method is not supported with authorization: %d", method);
                return(bleNoResources);
        }
    }
    else
#endif // #ifndef MIAPI_PORT_AUTHORIZATION_FTR
    {
        // no Authorization callback has been done.
        // reply with the read.
        return(miapi_port_ReadAttrValue(pAttr, pValue, pLen, offset, maxLen));
    }
}

static bStatus_t miapi_port_WriteAttrValue(uint8_t connHandle, gattAttribute_t *pAttr,
                                           uint8_t *pValue, uint16_t len,
                                           uint16_t offset)
{  
  bStatus_t status = SUCCESS;
    
