MiEcosystem/mijia_ble_api/cc26xx_api.c
  if ((pAttr->type.len == ATT_BT_UUID_SIZE) &&
      (GATT_CLIENT_CHAR_CFG_UUID == BUILD_UINT16(pAttr->type.uuid[0], pAttr->type.uuid[1])))
  {
    // 16-bit UUID
    status = GATTServApp_ProcessCCCWriteReq(connHandle, pAttr, pValue, len,
                                              offset, GATT_CLIENT_CFG_NOTIFY | GATT_CLIENT_CFG_INDICATE);
  }
  else
  {
    // Find Attribute to write on
    // At this point, this should only be a Characteristic Value, since all other attribute are READ ONLY.
    qCharValueRec_t* charValue = miapi_port_GattTblFindCharByPtrs(pAttr->pValue);
    MIBLE_PORT_ASSERT(charValue);
    if ((offset > charValue->maxLen) || ((offset + len) > charValue->maxLen))
    {
      return(ATT_ERR_INVALID_OFFSET);
    }
    else if (len > charValue->maxLen)
    {
      return(ATT_ERR_INVALID_VALUE_SIZE);
    }

    if(charValue->flag.is_variable_len)
    {
      charValue->len = len + offset;
    }
    uint8 *pCurValue = (uint8 *)pAttr->pValue;
    VOID memcpy(pCurValue + offset, pValue, len);
  }

  if (status == SUCCESS)
  {
    // start a task to call the callback in a different context...
    {
      gatt_event_t* author = ICall_mallocLimited(sizeof(gatt_event_t));
      MIBLE_PORT_ASSERT(author);
      if(!author) return(bleNoResources);
      author->evt = MIBLE_GATTS_EVT_WRITE;
      author->gattsParams.conn_handle = connHandle;
      author->gattsParams.write.value_handle = pAttr->handle;
      if ((pAttr->type.len == ATT_BT_UUID_SIZE) &&
          (GATT_CLIENT_CHAR_CFG_UUID == BUILD_UINT16(pAttr->type.uuid[0], pAttr->type.uuid[1])))
      {
          gattCharCfg_t * chartbl = GATT_CCC_TBL(pAttr->pValue);
          for ( uint8_t i = 0; i < linkDBNumConns; i++ )
          {
            if ( chartbl[i].connHandle == connHandle )
            {
              // Entry found
                author->gattsParams.write.data =  (uint8_t*) ( &(chartbl[i].value) );
                break;
            }
          }
      }
      else
      {
          author->gattsParams.write.data = (pAttr->pValue) + offset;
      }
      author->gattsParams.write.len = len;
      author->gattsParams.write.offset = offset;
      mible_status_t status = mible_task_post(miapi_port_gattTask, author);
      MIBLE_PORT_ASSERT(status==MI_SUCCESS);
      if(MI_SUCCESS != status)
      {
        return(bleNoResources);
      }
    }
  }
  return(status);
}

/*********************************************************************
 * @fn      miapi_port_WriteAttrCB
 *
 * @brief   Validate attribute data prior to a write operation
 *
 * @param   connHandle - connection message was received on
 * @param   pAttr - pointer to attribute
 * @param   pValue - pointer to data to be written
 * @param   len - length of data
 * @param   offset - offset of the first octet to be written
 * @param   method - type of write message
 *
 * @return  SUCCESS, blePending or Failure
 */
static bStatus_t miapi_port_WriteAttrCB(uint16_t connHandle,
                                           gattAttribute_t *pAttr,
                                           uint8_t *pValue, uint16_t len,
                                           uint16_t offset, uint8_t method)
{
  MIBLE_PORT_DBG2(": Handle: %d , method: %d", pAttr->handle, method);
#ifdef MIAPI_PORT_AUTHORIZATION_FTR
  qCharValueRec_t* charValue = miapi_port_GattTblFindCharByPtrs((uint8_t*) pAttr->pValue);
  // The attribute being written could be a CCC attribute.
  // if so, charValue will be null... and no authorization is requiered.
  // Check is it requires authorization
  if ((charValue) && (charValue->flag.wr_author))
  {
    // if yes, return ble_epending and signal it.
    // Store all needed information about the ATT operation...
    // only one ATT operation at teh same time, some method are not supported yet.
    switch(method)
    {
       case ATT_WRITE_REQ:
         MIBLE_PORT_ASSERT(!port_object.ATTop.flag.validity);
         if (port_object.ATTop.flag.validity)
         {
           return(bleInternalError);
         }
         port_object.ATTop.flag.validity = 1;
         port_object.ATTop.flag.authorNeeded = 1;
         port_object.ATTop.flag.safe_to_dealloc = 1;
         port_object.ATTop.connHandle = connHandle;
         port_object.ATTop.maxLen = len;
         port_object.ATTop.pAttr  = pAttr;
         port_object.ATTop.offset = offset;
         port_object.ATTop.pValue = pValue;
         port_object.ATTop.method = method;
         // start a tasklet to call the callback in a different context...
         {
           gatt_event_t* author = ICall_mallocLimited(sizeof(gatt_event_t));
           MIBLE_PORT_ASSERT(author);
           if(!author) return(bleNoResources);
           author->evt = MIBLE_GATTS_EVT_WRITE_PERMIT_REQ;
           author->gattsParams.conn_handle = connHandle;
           author->gattsParams.write.value_handle = pAttr->handle;
           author->gattsParams.write.data = pValue;
           author->gattsParams.write.len = len;
           author->gattsParams.write.offset = offset;
           mible_status_t status = mible_task_post(miapi_port_gattTask, author);
           MIBLE_PORT_ASSERT(status==MI_SUCCESS);
           if(MI_SUCCESS != status)
           {
             ICall_free(author);
             return(bleNoResources);
           }
         }
         return(blePending);
       case ATT_EXECUTE_WRITE_REQ:
       case ATT_PREPARE_WRITE_REQ:
       case ATT_WRITE_CMD:
       case ATT_SIGNED_WRITE_CMD:
       default:
         MIBLE_PORT_LOG_WAR1("this method is not supported with authorization: %d", method);
         return(bleNoResources);
    }
  }
  else
#endif // MIAPI_PORT_AUTHORIZATION_FTR
  {
    // no Authorization callback has been done.
    // reply with the read.
    return(miapi_port_WriteAttrValue(connHandle, pAttr, pValue, len, offset));
  }
}

/*********************************************************************
 * @fn      miapi_port_advCallback
 *
 * @brief   GapAdv module callback
 *
 * @param   pMsg - message to process
 */
static void miapi_port_advCallback(uint32_t event, void *pBuf, uintptr_t arg)
{
}

/*********************************************************************
 * @fn      miapi_port_scanCb
 *
 * @brief   Callback called by GapScan module
 *
 * @param   evt - event
 * @param   msg - message coming with the event
 * @param   arg - user argument
 *
 * @return  none
 */
void miapi_port_scanCb(uint32_t evt, void* pMsg, uintptr_t arg)
{
  if (evt & GAP_EVT_ADV_REPORT)
  {
    // The report will come back as an event...
    mible_task_post(miapi_port_advReport, pMsg);
  }
  else
  {
    return;
  }
}

static void miapi_port_advReport( void *pData )
{
  mible_gap_evt_t evt;
  mible_gap_evt_param_t gap_params = {0};
  GapScan_Evt_AdvRpt_t* pAdvRpt = (GapScan_Evt_AdvRpt_t*) (pData);
  
  gap_params.conn_handle = 0;
  gap_params.report.addr_type = (pAdvRpt->addrType == ADDRTYPE_PUBLIC || pAdvRpt->addrType == ADDRTYPE_PUBLIC_ID) ? MIBLE_ADDRESS_TYPE_PUBLIC : MIBLE_ADDRESS_TYPE_RANDOM;
  memcpy(gap_params.report.peer_addr, pAdvRpt->addr, 6);
  gap_params.report.adv_type = (pAdvRpt->evtType == ADV_RPT_EVT_TYPE_SCAN_RSP) ? SCAN_RSP_DATA : ADV_DATA;
  gap_params.report.rssi = pAdvRpt->rssi;
  memcpy(gap_params.report.data, pAdvRpt->pData, pAdvRpt->dataLen);;
  gap_params.report.data_len = pAdvRpt->dataLen;  
  
  MI_LOG_INFO("addr_type:%d, peer:%02x:%02x:%02x:%02x:%02x:%02x, event:%d, rssi:%d, len:%d",
              gap_params.report.addr_type, gap_params.report.peer_addr[0], gap_params.report.peer_addr[1], gap_params.report.peer_addr[2],
              gap_params.report.peer_addr[3], gap_params.report.peer_addr[4], gap_params.report.peer_addr[5], gap_params.report.peer_addr,
              gap_params.report.rssi, gap_params.report.data_len);

