MiEcosystem/mijia_ble_api/cc26xx_api.c
  evt = MIBLE_GAP_EVT_ADV_REPORT;
  mible_gap_event_callback(evt, &gap_params);
}

/**
 *        GATT Server APIs
 */
static uint16_t miapi_port_getServiceSize(mible_gatts_srv_db_t *pSrv)
{
  uint8_t mibleAttrTblNum = 0;
  // To get attribute number first.
  // First attribute in service define is always Service Declaration
  mibleAttrTblNum++;

  // Inquire whole char list to calculate number of attributes.
  for (uint16_t charIdx = 0; charIdx < pSrv->char_num; charIdx++)
  {
    mible_gatts_char_db_t *pChar = pSrv->p_char_db + charIdx;
    
    // Each char at least has a declaration & value attribute. mibleAttrTblNum+=2
    mibleAttrTblNum = mibleAttrTblNum + 2; 
    // If the char has notify property, it should have a CCC attribute
    if (pChar->char_property & ( MIBLE_NOTIFY | MIBLE_INDICATE)) mibleAttrTblNum++;
    if (pChar->char_desc_db.extend_prop) mibleAttrTblNum++;
    if (pChar->char_desc_db.char_format) mibleAttrTblNum++;
    if (pChar->char_desc_db.user_desc) mibleAttrTblNum++;
  }
  return(mibleAttrTblNum);
}

static mible_status_t miapi_port_GattTblConvert(mible_gatts_srv_db_t *pSrv)
{
  bStatus_t ret = SUCCESS;
  uint8_t charIdx = 0;
  uint16_t mibleAttrTblIdx = 0;
  gattAttribute_t *pMibleAttrTbl = NULL;
  uint16_t mibleAttrTblNum = miapi_port_getServiceSize(pSrv);
  uint16_t offsetHandle = GATT_GetNextHandle();
  
  MIBLE_PORT_LOG_HEAP_START();

  pMibleAttrTbl = (gattAttribute_t*)ICall_mallocLimited(sizeof(gattAttribute_t) * mibleAttrTblNum);
  if (pMibleAttrTbl == NULL)
  {
    MIBLE_PORT_ASSERT(pMibleAttrTbl);
    return(MI_ERR_NO_MEM);
  }

  qServiceRec_t *pMibleAttrTblTmp = (qServiceRec_t*)ICall_mallocLimited(sizeof(qServiceRec_t));
  memset(pMibleAttrTblTmp, 0, sizeof(qServiceRec_t));
  if (pMibleAttrTblTmp == NULL)
  {
    // all previously allocated memory should be free, but there is no point to continue execution
    // if no more memory are available...
    MIBLE_PORT_ASSERT(pMibleAttrTblTmp);
    return(MI_ERR_NO_MEM);
  }

  pMibleAttrTblTmp->charValueQHdl = Util_constructQueue(&pMibleAttrTblTmp->charValueQ);

  uint8_t pSrvUUIDlen = (pSrv->srv_uuid.type == MIBLE_UUID_16) ? ATT_BT_UUID_SIZE : ATT_UUID_SIZE;
  uint8_t *pSrvUUID = (uint8_t*)ICall_mallocLimited(pSrvUUIDlen);
  if (pSrvUUID == NULL)
  {
    MIBLE_PORT_ASSERT(pMibleAttrTblTmp);
    return(MI_ERR_NO_MEM);
  }
  if (pSrv->srv_uuid.type == MIBLE_UUID_16)
  {
    (void) memcpy(pSrvUUID, &pSrv->srv_uuid.uuid16, pSrvUUIDlen);
  }
  else
  {
    (void) memcpy(pSrvUUID, pSrv->srv_uuid.uuid128, pSrvUUIDlen);
  }

  // Locate service UUID type
  gattAttrType_t *pServiceUUIDType = (gattAttrType_t*)ICall_mallocLimited(sizeof(gattAttrType_t));
  if (pServiceUUIDType == NULL)
  {
    MIBLE_PORT_ASSERT(pServiceUUIDType);
    return(MI_ERR_NO_MEM);
  }
  
  pServiceUUIDType->len = pSrvUUIDlen;
  pServiceUUIDType->uuid = pSrvUUID;
      
  // Create a temporary attribute body, due to pValue member is const pointer, need to use memcpy to copy later.
  gattAttribute_t tmpAttrSrvDec = GATT_PRIMARY_SERVICE((uint8 *)pServiceUUIDType);

  if (pSrv->srv_type != 1)
  {
      tmpAttrSrvDec.type.uuid = (const uint8 *) secondaryServiceUUID;
  }

  pSrv->srv_handle = mibleAttrTblIdx + offsetHandle;
  VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpAttrSrvDec, sizeof(gattAttribute_t));

  // Now copy all the char attributes' information to the table.
  for (charIdx = 0; charIdx < pSrv->char_num; charIdx++)
  {
    mible_gatts_char_db_t *pChar = &pSrv->p_char_db[charIdx];
    // Copy char declaration.
    uint8_t *pCharProp = (uint8_t*)ICall_mallocLimited(sizeof(uint8_t));
    if (pCharProp == NULL)
    {
      // all previously allocated memory should be free, but there is no point to continue execution
      // if no more memory are available...
      MIBLE_PORT_ASSERT(pCharProp);
      return(MI_ERR_NO_MEM);
    }
    
    *pCharProp = pChar->char_property;
    
    gattAttribute_t tmpAttrCharDec = GATT_CHAR_ATTR(pCharProp);
    
    VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpAttrCharDec, sizeof(gattAttribute_t));

    // Copy char value.
    // UUID
    uint8_t pCharUUIDlen = (pChar->char_uuid.type == MIBLE_UUID_16) ? ATT_BT_UUID_SIZE : ATT_UUID_SIZE;
    uint8_t *pCharUUID = (uint8_t*)ICall_mallocLimited(pCharUUIDlen);
  
    if (pCharUUID == NULL)
    {
      // all previously allocated memory should be free, but there is no point to continue execution
      // if no more memory are available...
      MIBLE_PORT_ASSERT(pCharUUID);
      return(MI_ERR_NO_MEM);
    }
    if (pChar->char_uuid.type == MIBLE_UUID_16)
    {
      (void) memcpy(pCharUUID, &pChar->char_uuid.uuid16, pCharUUIDlen);
    }
    else
    {
      (void) memcpy(pCharUUID, pChar->char_uuid.uuid128, pCharUUIDlen);
    }

    // Value permissions.
    uint8_t vPermission = 0;
    if (pChar->char_property & MIBLE_READ)
    {
      vPermission |= GATT_PERMIT_READ;
    }
    if ((pChar->char_property & MIBLE_WRITE) || (pChar->char_property & MIBLE_WRITE_WITHOUT_RESP))
    {
      vPermission |= GATT_PERMIT_WRITE;
    }
    if (pChar->rd_author)
    {
      vPermission |= GATT_PERMIT_READ;
#ifndef MIAPI_PORT_AUTHORIZATION_FTR
      MIBLE_PORT_ASSERT(YOU_NEED_TO_ENABLE_AUTHORIZATION_FEATURE);
#endif // MIAPI_PORT_AUTHORIZATION_FTR
    }
    if (pChar->wr_author)
    {
      vPermission |= GATT_PERMIT_WRITE;
#ifndef MIAPI_PORT_AUTHORIZATION_FTR
      MIBLE_PORT_ASSERT(YOU_NEED_TO_ENABLE_AUTHORIZATION_FEATURE);
#endif // MIAPI_PORT_AUTHORIZATION_FTR
    }
    
    // Data, Value
    // if characteristic is variable length, the len is considered the maximum length of the characteristic?
    uint8_t *pCharValue = (uint8_t*)ICall_mallocLimited(pChar->char_value_len);
    if (pCharValue == NULL)
    {
      // all previously allocated memory should be free, but there is no point to continue execution
      // if no more memory are available...
      MIBLE_PORT_ASSERT(pCharValue);
      return(MI_ERR_NO_MEM);
    }
     
    VOID memcpy(pCharValue, pChar->p_value, pChar->char_value_len);
    
    gattAttribute_t tmpAttrCharValue= GATT_CHAR_VALUE_ATTRIB(pCharUUIDlen, pCharUUID, vPermission, pCharValue);

