MiEcosystem/mijia_ble_api/cc26xx_api.c
    qCharValueRec_t *pCharValueTemp = (qCharValueRec_t*)ICall_mallocLimited(sizeof(qCharValueRec_t));
    if (pCharValueTemp == NULL)
    {
      // all previously allocated memory should be free, but there is no point to continue execution
      // if no more memory are available...
      MIBLE_PORT_ASSERT(pCharValueTemp);
      return(MI_ERR_NO_MEM);
    }
    memset(pCharValueTemp, 0, sizeof(qCharValueRec_t));
    pCharValueTemp->flag.is_variable_len = pChar->is_variable_len;
#ifdef MIAPI_PORT_AUTHORIZATION_FTR
    pCharValueTemp->flag.rd_author = pChar->rd_author;
    pCharValueTemp->flag.wr_author = pChar->wr_author;
#endif //MIAPI_PORT_AUTHORIZATION_FTR
    pCharValueTemp->handle = 0;
    //pCharValueTemp->pCharValue = pCharValue;
    pCharValueTemp->pCCCValue = 0;
    pCharValueTemp->pAttr = pMibleAttrTbl + mibleAttrTblIdx;
    pCharValueTemp->len = pChar->char_value_len;
    pCharValueTemp->maxLen = pChar->char_value_len;

    pChar->char_value_handle = pCharValueTemp->handle = mibleAttrTblIdx + offsetHandle;
    VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpAttrCharValue, sizeof(gattAttribute_t));
    
    if (pChar->char_property & (MIBLE_NOTIFY | MIBLE_INDICATE) )
    {
      gattCharCfg_t *pCharCCC = (gattCharCfg_t*)ICall_mallocLimited(sizeof(gattCharCfg_t*) + sizeof(gattCharCfg_t) * MAX_NUM_BLE_CONNS);
      if (pCharCCC == NULL)
      {
        // all previously allocated memory should be free, but there is no point to continue execution
        // if no more memory are available...
        MIBLE_PORT_ASSERT(pCharCCC);
        return(MI_ERR_NO_MEM);
      }
      
      //Assign the value
      *((uint8_t**)(pCharCCC)) = ((uint8_t*)(pCharCCC)) + sizeof(gattCharCfg_t*);

      gattAttribute_t tmpAttrCharCCC = GATT_CCC_ATTRIB(pCharCCC);
      
      VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpAttrCharCCC, sizeof(gattAttribute_t));
      pCharValueTemp->pCCCValue = pCharCCC;
       
      GATTServApp_InitCharCfg(LINKDB_CONNHANDLE_INVALID, GATT_CCC_TBL(pCharCCC));
    }

    if (pChar->char_desc_db.extend_prop)
    {
      uint16_t *pCharExtProp = (uint16_t*)ICall_mallocLimited(sizeof(uint16_t));
      *pCharExtProp = 0;
      if (pCharExtProp == NULL)
      {
        // all previously allocated memory should be free, but there is no point to continue execution
        // if no more memory are available...
        MIBLE_PORT_ASSERT(pCharExtProp);
        return(MI_ERR_NO_MEM);
      }

      // This copy works fine since structure gattCharFormat_t and mible_gatts_char_desc_user_desc_t are identical.
      *pCharExtProp = (pChar->char_desc_db.extend_prop->reliable_write |  pChar->char_desc_db.extend_prop->writeable);

      gattAttribute_t tmpExtProp = GATT_CHAR_EXT_PROP_ATTRIB(pCharExtProp);
      VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpExtProp, sizeof(gattAttribute_t));
    }

    if (pChar->char_desc_db.char_format)
    {
        gattCharFormat_t *pCharFormat = (gattCharFormat_t*)ICall_mallocLimited(sizeof(gattCharFormat_t));
        if (pCharFormat == NULL)
        {
          // all previously allocated memory should be free, but there is no point to continue execution
          // if no more memory are available...
          MIBLE_PORT_ASSERT(pCharFormat);
          return(MI_ERR_NO_MEM);
        }

        // This copy works fine since structure gattCharFormat_t and mible_gatts_char_desc_user_desc_t are identical.
        MIBLE_PORT_ASSERT(sizeof(mible_gatts_char_desc_user_desc_t) == sizeof(gattCharFormat_t));
        VOID memcpy(pCharFormat, pChar->char_desc_db.char_format, sizeof(gattCharFormat_t));

        gattAttribute_t tmpAttrFormat = GATT_CHAR_FORMAT_ATTRIB(pCharFormat);
        VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpAttrFormat, sizeof(gattAttribute_t));
    }

    if (pChar->char_desc_db.user_desc)
    {
      uint8_t *pCharUserDesc = (uint8_t*)ICall_mallocLimited(pChar->char_desc_db.user_desc->len);
      if (pCharUserDesc == NULL)
      {
        // all previously allocated memory should be free, but there is no point to continue execution
        // if no more memory are available...
        MIBLE_PORT_ASSERT(pCharUserDesc);
        return(MI_ERR_NO_MEM);
      }

      // This copy works fine since structure gattCharFormat_t and mible_gatts_char_desc_user_desc_t are identical.
      VOID memcpy(pCharUserDesc, pChar->char_desc_db.user_desc->string, pChar->char_desc_db.user_desc->len);

      gattAttribute_t tmpAttrUserDesc = GATT_CHAR_USER_DESC_ATTRIB(pCharUserDesc);
      VOID memcpy(pMibleAttrTbl + mibleAttrTblIdx++, &tmpAttrUserDesc, sizeof(gattAttribute_t));
    }
    Queue_put(pMibleAttrTblTmp->charValueQHdl, &pCharValueTemp->_elem);
  }  // end for loop
  
  
  pMibleAttrTblTmp->pAttrSrvTbl = pMibleAttrTbl;

  Queue_put(port_object.serviceQHdl, &pMibleAttrTblTmp->_elem);

  // Register GATT attribute list and CBs with GATT Server App
  ret = GATTServApp_RegisterService(pMibleAttrTbl,
                                    mibleAttrTblNum,
                                    GATT_MAX_ENCRYPT_KEY_SIZE,
                                    &MibleProfileCBs);
  MIBLE_PORT_LOG_HEAP_END()
  return(miapi_port_translateError(ret));
}

/*********************************************************************
 * @fn      miapi_port_miapi_porting_init
 *
 * @brief   Initialization function of the porting layer.
 * 
 *          This function will register the necessary API to interact
 *          with the application and the ble stack.
 *          The following callback are registered:
 *          init_cb: callback returned once the stack and application
 *          is initialized
 *          gap_event_cb: call when a GAP event is send by the stack/application
 *          miapi_task: call to execute any pending task in a low priority context.
 *
 *          
 * @param   pMsg - message to process
 */
void miapi_port_initialization(mible_port_cb_t **cb)
{
    MIBLE_PORT_ASSERT(cb);
    *cb = &port_object.callbacks;
    MIBLE_PORT_DBG1("callback registered: %p", (uintptr_t)*cb);
}

/*********************************************************************
 * LOCAL FUNCTIONS
 */

static void miapi_port_init (Event_Handle sync, uint8_t taskId)
{
  uint8_t status;

