MiEcosystem/mijia_ble_api/cc26xx_api.c
  // Initialize the porting Layer
  // Create an RTOS queue for message from profile to be sent to app
  MIBLE_PORT_DBG1("Sync: %p , enqueue: %p", (uintptr_t) sync);
  port_object.taskQHdl = Util_constructQueue(&port_object.taskQ);
  port_object.appSync = sync;
  port_object.taskId = taskId;
  
  port_object.serviceQHdl = Util_constructQueue(&port_object.serviceQ);

  // Create Legacy Advertisement Set that will be used by MiBLE
  GapAdv_params_t advParam = GAPADV_PARAMS_LEGACY_SCANN_CONN;

  // Create Advertisement set #1 and assign handle
  status = GapAdv_create((pfnGapCB_t *) &miapi_port_advCallback, &advParam, &port_object.advHandle);
  MIBLE_PORT_ASSERT(status==SUCCESS);

  port_object.advPayload = (uint8_t*) ICall_mallocLimited(sizeof(advertDataDefault));
  memcpy(port_object.advPayload, advertDataDefault, sizeof(advertDataDefault));
  MIBLE_PORT_ASSERT(port_object.advPayload);
  status = GapAdv_loadByHandle(port_object.advHandle, GAP_ADV_DATA_TYPE_ADV,
                               sizeof(advertDataDefault), port_object.advPayload);
  MIBLE_PORT_ASSERT(status==SUCCESS);
  
  // Get NVS driver API.
  // the stack is initializing the NV area.
#ifdef CC26X2
  NVOCTP_loadApiPtrs(&port_object.NVpfn);
#else
  port_object.NVpfn.compactNV = NVOCOP_compactNV;
  port_object.NVpfn.readItem = NVOCOP_readItem;
  port_object.NVpfn.writeItem = NVOCOP_writeItem;
#endif // CC26X2
  MIBLE_PORT_DBG0("Done");
}

/* This function handle All Stack Event received.
 * No Memory are Freed at this time, this needs to be done in the main application thread.
 */
static void miapi_port_stackEvent (uint8_t stackEventCat, void * data)
{
  if(port_object.appSync)
  {
    switch(stackEventCat)
    {
      case GAP_MSG_EVENT:
      {
        gapEventHdr_t* pMsg = (gapEventHdr_t*) data;
        miapi_port_gapEvent(pMsg);
        break;
      }
      case GATT_MSG_EVENT:
      {
        gattMsgEvent_t *pMsg = (gattMsgEvent_t*) data;
        miapi_port_gattEvent(pMsg);
        break;
      }
      default:
          break;
    }
  }
}

/* This function handle GATT event received from the Stack
 * No Memory are freed at this time, this needs to be done in the main application thread.
 */
static void miapi_port_gattEvent(gattMsgEvent_t *pMsg)
{
  if (pMsg->method == ATT_HANDLE_VALUE_CFM)
  {
      mible_gatts_event_callback(MIBLE_GATTS_EVT_IND_CONFIRM, NULL);
  }
}

/* This function handle GAP event received from the Stack
 * No Memory are freed at this time, this needs to be done in the main application thread.
 */
static void miapi_port_gapEvent (gapEventHdr_t * data)
{
  if(port_object.appSync)
  {
      uint8_t event = data->opcode;
      switch (event)
      {
        case MI_APP_PORT_EVT_ADV_REPORT:
        {
          // not used yet... miapi_port_advReport(data);
          break;
        }
        case GAP_LINK_ESTABLISHED_EVENT:
        {
          gapEstLinkReqEvent_t *pPkt = (gapEstLinkReqEvent_t *)data;
          mible_gap_evt_param_t param;
          param.conn_handle = pPkt->connectionHandle;
          MIBLE_PORT_DBG0("Connection Established");
          if ( (pPkt->devAddrType == ADDRTYPE_PUBLIC) || (pPkt->devAddrType == ADDRTYPE_PUBLIC_ID))
          {
              param.connect.type = MIBLE_ADDRESS_TYPE_PUBLIC;
          }
          else
          {
              param.connect.type = MIBLE_ADDRESS_TYPE_RANDOM;
          }

          param.connect.role = (pPkt->connRole == GAP_PROFILE_CENTRAL?MIBLE_GAP_CENTRAL:MIBLE_GAP_PERIPHERAL);
          memcpy(param.connect.peer_addr, pPkt->devAddr, B_ADDR_LEN);
          param.connect.conn_param.min_conn_interval =  pPkt->connInterval;
          param.connect.conn_param.max_conn_interval = pPkt->connInterval;
          param.connect.conn_param.slave_latency = pPkt->connLatency;
          param.connect.conn_param.conn_sup_timeout = pPkt->connTimeout;
          mible_gap_event_callback(MIBLE_GAP_EVT_CONNECTED, &param);
          break;
        }
        case GAP_LINK_TERMINATED_EVENT:
        {
          gapTerminateLinkEvent_t *pPkt = (gapTerminateLinkEvent_t *)data;
          mible_gap_evt_param_t param; 
          param.conn_handle = pPkt->connectionHandle;
          MIBLE_PORT_DBG1("Connection Terminated, reason: %d", pPkt->reason);
          if (pPkt->reason == LL_STATUS_ERROR_PEER_TERM)
          {
              param.disconnect.reason = REMOTE_USER_TERMINATED;
          }
          else if (pPkt->reason == LL_STATUS_ERROR_CONNECTION_TIMEOUT)
          {
              param.disconnect.reason = CONNECTION_TIMEOUT;
          }
          else if(pPkt->reason == LL_STATUS_ERROR_HOST_TERM)
          {
              param.disconnect.reason = LOCAL_HOST_TERMINATED;
          }
          else
          {
              // Other reason
              param.disconnect.reason = (mible_gap_disconnect_reason_t)0xFF;
          }
          mible_gap_event_callback(MIBLE_GAP_EVT_DISCONNET, &param);
          break;
        }
        case GAP_LINK_PARAM_UPDATE_EVENT:
        {
          gapLinkUpdateEvent_t *pPkt = (gapLinkUpdateEvent_t *)data;
          if (pPkt->status == SUCCESS)
          {
            mible_gap_evt_param_t param;
            MIBLE_PORT_DBG0("Connection parameter updated");
            param.update_conn.conn_param.min_conn_interval =  pPkt->connInterval;
            param.update_conn.conn_param.max_conn_interval = pPkt->connInterval;
            param.update_conn.conn_param.slave_latency = pPkt->connLatency;
            param.update_conn.conn_param.conn_sup_timeout = pPkt->connTimeout;
            mible_gap_event_callback(MIBLE_GAP_EVT_CONN_PARAM_UPDATED, &param);
          }
          else
          {
            MIBLE_PORT_LOG_ERR0("Connection Parameter update failed");
          }
          break;
        }
        default:
          break;
      }
  }
}

static uint16_t miapi_port_GattTblFindServiceHdleByCharHandle(uint16_t char_handle)
{
  qServiceRec_t *elem;

  for ( elem = Queue_head(port_object.serviceQHdl);
        elem != (qServiceRec_t *)port_object.serviceQHdl;
        elem = Queue_next(&elem->_elem))
  {
     if( elem->pAttrSrvTbl->handle > char_handle )
     {
         // The characteristic is in the previous service...
         return(((qServiceRec_t*)Queue_prev(&elem->_elem))->pAttrSrvTbl->handle);
     }
  }
  if( elem->pAttrSrvTbl->handle < char_handle )
  {
      // The characteristic is in the last service...
      return(elem->pAttrSrvTbl->handle);
  }
  return(NULL);
}

static qServiceRec_t* miapi_port_GattTblFindServiceByHandle(uint16_t srv_handle)
{
  qServiceRec_t *elem;

