MiEcosystem/mijia_ble_api/cc26xx_api.c
  for ( elem = Queue_head(port_object.serviceQHdl);
        elem != (qServiceRec_t *)port_object.serviceQHdl;
        elem = Queue_next(&elem->_elem))
  {
     if( elem->pAttrSrvTbl->handle == srv_handle )
     {
         return(elem);
     }
  }
  return(NULL);
}

static qCharValueRec_t* miapi_port_GattTblFindCharValueByHandle(qServiceRec_t *srv_table, uint16_t value_handle)
{
  qCharValueRec_t *elem;

  for ( elem = Queue_head(srv_table->charValueQHdl);
        elem != (qCharValueRec_t *)srv_table->charValueQHdl;
        elem = Queue_next(&elem->_elem))
  {
     if( elem->handle == value_handle )
     {
         return(elem);
     }
  }
  return(NULL);
}

/*
 * @brief   Get BLE mac address.
 * @param   [out] mac: pointer to data
 * @return  MI_SUCCESS          The requested mac address were written to mac
 *          MI_ERR_INTERNAL     No mac address found.
 * @note:   You should copy gap mac to mac[6]  
 * */
mible_status_t mible_gap_address_get(mible_addr_t mac)
{
  uint8_t *macAddr;

  macAddr = GAP_GetDevAddress(TRUE) ;

  VOID memcpy(mac, macAddr, B_ADDR_LEN);
  MIBLE_PORT_DBG3("Identity Address: [%x:%x:%x:...]", macAddr[5], macAddr[4], macAddr[3]);
  MIBLE_PORT_DBG3("Identity Address: [...:%x:%x:%x]", macAddr[2], macAddr[1], macAddr[0]);
  
  return(MI_SUCCESS);
}

/*
 * @brief   Start scanning
 * @param   [in] scan_type: passive or active scaning
 *          [in] scan_param: scan parameters including interval, windows
 * and timeout
 * @return  MI_SUCCESS             Successfully initiated scanning procedure.
 *          MI_ERR_INVALID_STATE   Has initiated scanning procedure.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending
 * events and retry.
 * @note    Other default scanning parameters : public address, no
 * whitelist.
 *          The scan response is given through
 * MIBLE_GAP_EVT_ADV_REPORT event
 */
mible_status_t mible_gap_scan_start(mible_gap_scan_type_t scan_type,
    mible_gap_scan_param_t scan_param)
{
  bStatus_t status = MI_SUCCESS;
  uint8_t tempPhy = SCAN_PRIM_PHY_1M;
  uint16_t tempField = (SCAN_ADVRPT_FLD_ADDRTYPE | SCAN_ADVRPT_FLD_ADDRESS);
  uint16_t typeFlt = SCAN_FLT_PDU_LEGACY_ONLY;
  uint8_t scanType = (scan_type == MIBLE_SCAN_TYPE_PASSIVE)? LL_SCAN_PASSIVE:SCAN_TYPE_ACTIVE;
  
  MIBLE_PORT_DBG4("Type: %d, interval: %d msec, window: %d msec, timeout: %d sec", scan_type, (uint32_t) (scan_param.scan_interval*0.625), (uint32_t)(scan_param.scan_window*0.625), (uint32_t)(scan_param.timeout*0.625));

  status = GapScan_registerCb(miapi_port_scanCb, NULL);

  GapScan_setEventMask(GAP_EVT_ADV_REPORT);


  status = GapScan_setPhyParams(SCAN_PRIM_PHY_1M, scanType,
                       scan_param.scan_interval, scan_param.scan_window);

  status = GapScan_setParam(SCAN_PARAM_RPT_FIELDS, &tempField);
  status = GapScan_setParam(SCAN_PARAM_PRIM_PHYS, &tempPhy);  
  status = GapScan_setParam(SCAN_PARAM_FLT_PDU_TYPE, &typeFlt);

  // Set LL Duplicate Filter
  //temp8 = SCAN_FLT_DUP_ENABLE;
  //status = GapScan_setParam(SCAN_PARAM_FLT_DUP, &temp8);
  
  status = GapScan_enable( 0, scan_param.timeout, 0 );
  MIBLE_PORT_ASSERT(status != SUCCESS);
  MIBLE_PORT_DBG1("Started, status: %d", status);
  return(miapi_port_translateError(status));
}


/*
 * @brief   Stop scanning
 * @param   void
 * @return  MI_SUCCESS             Successfully stopped scanning procedure.
 *          MI_ERR_INVALID_STATE   Not in scanning state.
 * */
mible_status_t mible_gap_scan_stop(void)
{
  uint8_t status;

  status = GapScan_disable();
  MIBLE_PORT_ASSERT(status != SUCCESS);
  MIBLE_PORT_DBG0("disabled");
  return(miapi_port_translateError(status));
}

/*
 * @brief   Start advertising
 * @param   [in] p_adv_param : pointer to advertising parameters, see
 * mible_gap_adv_param_t for details
 * @return  MI_SUCCESS             Successfully initiated advertising procedure.
 *          MI_ERR_INVALID_STATE   Initiated connectable advertising procedure
 * when connected.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and
 * retry.
 *          MI_ERR_RESOURCES       Stop one or more currently active roles
 * (Central, Peripheral or Observer) and try again.
 * @note    Other default advertising parameters: local public address , no
 * filter policy
 * */
mible_status_t mible_gap_adv_start(mible_gap_adv_param_t *p_adv_param)
{
  uint8_t status = SUCCESS;
  uint16_t type;
  uint8_t map = 0;
  MIBLE_PORT_DBG3("adv min: %d, adv max: %d, type: %d",
                  (uintptr_t) p_adv_param->adv_interval_min,
                  (uintptr_t) p_adv_param->adv_interval_max,
                  (uintptr_t) p_adv_param->adv_type);
  MIBLE_PORT_ASSERT(p_adv_param);

  switch(p_adv_param->adv_type)
  {
    case MIBLE_ADV_TYPE_CONNECTABLE_UNDIRECTED:
      type = GAP_ADV_PROP_SCANNABLE | GAP_ADV_PROP_CONNECTABLE | GAP_ADV_PROP_LEGACY;
      break;
    case MIBLE_ADV_TYPE_SCANNABLE_UNDIRECTED:
      type = GAP_ADV_PROP_SCANNABLE | GAP_ADV_PROP_LEGACY;
      break;
    case MIBLE_ADV_TYPE_NON_CONNECTABLE_UNDIRECTED:
      type = GAP_ADV_PROP_LEGACY;
      break;
    default:
      MIBLE_PORT_LOG_WAR0("invalid param! ");
      return(MI_ERR_INVALID_PARAM);
  }

  if(p_adv_param->ch_mask.ch_37_off == 0)
    map |= GAP_ADV_CHAN_37;

  if(p_adv_param->ch_mask.ch_38_off == 0)
    map |= GAP_ADV_CHAN_38;

  if(p_adv_param->ch_mask.ch_39_off == 0)
    map |= GAP_ADV_CHAN_39;

  status = GapAdv_setParam(port_object.advHandle, GAP_ADV_PARAM_PROPS, &type);
  STATUS_CHECK(miapi_port_translateError(status))
  {
    uint32_t interval = (uint32_t) p_adv_param->adv_interval_min;
    status = GapAdv_setParam(port_object.advHandle, GAP_ADV_PARAM_PRIMARY_INTERVAL_MIN, &interval);
    STATUS_CHECK(miapi_port_translateError(status))
    interval = (uint32_t) p_adv_param->adv_interval_max;
    status = GapAdv_setParam(port_object.advHandle, GAP_ADV_PARAM_PRIMARY_INTERVAL_MAX, &interval);
    STATUS_CHECK(miapi_port_translateError(status))
  }
  status = GapAdv_setParam(port_object.advHandle, GAP_ADV_PARAM_PRIMARY_CHANNEL_MAP, &map);
  STATUS_CHECK(miapi_port_translateError(status))

  status = GapAdv_enable(port_object.advHandle, GAP_ADV_ENABLE_OPTIONS_USE_MAX , 0);
  MIBLE_PORT_ASSERT(status == SUCCESS);
  MIBLE_PORT_DBG1("enabled (status : %d)", status);
  return(miapi_port_translateError(status));
}

