MiEcosystem/mijia_ble_api/cc26xx_api.c
/*
 * @brief   Config advertising data
 * @param   [in] p_data : Raw data to be placed in advertising packet. If NULL, no changes are made to the current advertising packet.
 * @param   [in] dlen   : Data length for p_data. Max size: 31 octets. Should be 0 if p_data is NULL, can be 0 if p_data is not NULL.
 * @param   [in] p_sr_data : Raw data to be placed in scan response packet. If NULL, no changes are made to the current scan response packet data.
 * @param   [in] srdlen : Data length for p_sr_data. Max size: BLE_GAP_ADV_MAX_SIZE octets. Should be 0 if p_sr_data is NULL, can be 0 if p_data is not NULL.
 * @return  MI_SUCCESS             Successfully set advertising data.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 * */   
mible_status_t mible_gap_adv_data_set(uint8_t const * p_data, uint8_t dlen, uint8_t const *p_sr_data, uint8_t srdlen)
{
  bStatus_t status = 0;
  MIBLE_PORT_DBG2("New Adv Data, len: %d,  New Scan Rsp data len: %d", dlen, srdlen);
    
  MIBLE_PORT_ASSERT(dlen < 32);
  MIBLE_PORT_ASSERT(srdlen < 32);

  if (p_data)
  {
    MIBLE_PORT_DBG0("Updating Adv Data...");
    status = GapAdv_prepareLoadByHandle(port_object.advHandle, GAP_ADV_FREE_OPTION_ADV_DATA);
    MIBLE_PORT_ASSERT(status == SUCCESS);
    if (dlen)
    {
      if(!(port_object.advPayload = (uint8_t*) ICall_mallocLimited(dlen)))
      {
        return(MI_ERR_NO_MEM);
      }
      memcpy(port_object.advPayload, p_data, dlen);
    }
    else
    {
      MIBLE_PORT_DBG0("emptying Adv Data...");
      port_object.advPayload = NULL;
    }
    status = GapAdv_loadByHandle(port_object.advHandle, GAP_ADV_DATA_TYPE_ADV,
                                 dlen, port_object.advPayload);
    MIBLE_PORT_ASSERT(status == SUCCESS);
  }

  if (p_sr_data)
  {
    MIBLE_PORT_DBG0("Updating Scan rsp Data...");
    if (port_object.advSrPayload)
    {
        status = GapAdv_prepareLoadByHandle(port_object.advHandle, GAP_ADV_FREE_OPTION_SCAN_RESP_DATA);
        MIBLE_PORT_ASSERT(status == SUCCESS);
    }
    if (srdlen)
    {
      if(!(port_object.advSrPayload = (uint8_t*) ICall_mallocLimited(srdlen)))
      {
        return(MI_ERR_NO_MEM);
      }
      memcpy(port_object.advSrPayload, p_sr_data, srdlen);
    }
    else
    {
      MIBLE_PORT_DBG0("emptying Scan Rsp Data...");
      port_object.advSrPayload = NULL;
    }
    status = GapAdv_loadByHandle(port_object.advHandle, GAP_ADV_DATA_TYPE_SCAN_RSP,
                                 srdlen, port_object.advSrPayload);
    MIBLE_PORT_ASSERT(status == SUCCESS);
  }

  MIBLE_PORT_DBG0("Update(s) Done...");
  if (status == SUCCESS)
    return(MI_SUCCESS);
  else
    MIBLE_PORT_LOG_WAR0("invalid param! ");
    return(MI_ERR_INVALID_PARAM);
}

/*
 * @brief   Stop advertising
 * @param   void
 * @return  MI_SUCCESS             Successfully stopped advertising procedure.
 *          MI_ERR_INVALID_STATE   Not in advertising state.
 * */
mible_status_t mible_gap_adv_stop(void)
{
  bStatus_t status = SUCCESS;

  status = GapAdv_disable(port_object.advHandle);
  MIBLE_PORT_DBG1("adv stopped...status: %d", status);
  return(miapi_port_translateError(status));
}


/*
 * @brief   Create a Direct connection
 * @param   [in] scan_param : scanning parameters, see TYPE
 * mible_gap_scan_param_t for details.
 *          [in] conn_param : connection parameters, see TYPE
 * mible_gap_connect_t for details.
 * @return  MI_SUCCESS             Successfully initiated connection procedure.
 *          MI_ERR_INVALID_STATE   Initiated connection procedure in connected state.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and retry.
 *          MI_ERR_RESOURCES       Stop one or more currently active roles
 * (Central, Peripheral or Observer) and try again
 *          MIBLE_ERR_GAP_INVALID_BLE_ADDR    Invalid Bluetooth address
 * supplied.
 * @note    Own and peer address are both public.
 *          The connection result is given by MIBLE_GAP_EVT_CONNECTED
 * event
 * */
mible_status_t mible_gap_connect(mible_gap_scan_param_t scan_param,
    mible_gap_connect_t conn_param)
{
  // TODO with scanning
  return MI_SUCCESS;
}


/*
 * @brief   Disconnect from peer
 * @param   [in] conn_handle: the connection handle
 * @return  MI_SUCCESS             Successfully disconnected.
 *          MI_ERR_INVALID_STATE   Not in connnection.
 *          MIBLE_ERR_INVALID_CONN_HANDLE
 * @note    This function can be used by both central role and periphral
 * role.
 * */
mible_status_t mible_gap_disconnect(uint16_t conn_handle)
{
  uint8_t status = GAP_TerminateLinkReq( conn_handle, HCI_DISCONNECT_REMOTE_USER_TERM );
  MIBLE_PORT_DBG2("Terminating Connection: hdl: %d , status: %d", conn_handle, status);
  if (status != SUCCESS)
  {
    return(MIBLE_ERR_INVALID_CONN_HANDLE);
  }
  return MI_SUCCESS;
}

/*
 * @brief   Update the connection parameters.
 * @param   [in] conn_handle: the connection handle.
 *          [in] conn_params: the connection parameters.
 * @return  MI_SUCCESS             The Connection Update procedure has been
 *started successfully.
 *          MI_ERR_INVALID_STATE   Initiated this procedure in disconnected
 *state.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and
 *retry.
 *          MIBLE_ERR_INVALID_CONN_HANDLE
 * @note    This function can be used by both central role and peripheral
 *role.
 * */
mible_status_t mible_gap_update_conn_params(uint16_t conn_handle,
    mible_gap_conn_param_t conn_params)
{
  gapUpdateLinkParamReq_t req;
  MIBLE_PORT_DBG4("Requesting Connection Update: hdl: %d , Timeout: %d Min/Max: %d/%d",
                  (uintptr_t) conn_handle,
                  (uintptr_t) conn_params.conn_sup_timeout,
                  (uintptr_t) conn_params.min_conn_interval,
                  (uintptr_t) conn_params.max_conn_interval);

  req.connectionHandle = conn_handle;
  req.connLatency = conn_params.slave_latency;
  req.connTimeout = conn_params.conn_sup_timeout;;
  req.intervalMin = conn_params.min_conn_interval;;
  req.intervalMax = conn_params.max_conn_interval;;

