MiEcosystem/mijia_ble_api/cc26xx_api.c
  // Send parameter update
  bStatus_t status = GAP_UpdateLinkParamReq(&req);
  if(status == bleAlreadyInRequestedMode)
  {
    MIBLE_PORT_LOG_WAR0("invalid param or already performing an equivalent request...");
    return MI_ERR_INVALID_STATE;
  }
  MIBLE_PORT_DBG0("request sent");
  return MI_SUCCESS;
}


/**
 * @brief   Add a Service to a GATT server
 * @param   [in|out] p_server_db: pointer to mible service data type 
 * of mible_gatts_db_t, see TYPE mible_gatts_db_t for details. 
 * @return  MI_SUCCESS             Successfully added a service declaration.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_NO_MEM          Not enough memory to complete operation.
 * @note    This function can be implemented asynchronous. When service inition complete, call mible_arch_event_callback function and pass in MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP event and result.
 * */
mible_status_t mible_gatts_service_init(mible_gatts_db_t *p_server_db)
{
  mible_status_t status;
  MIBLE_PORT_DBG1("Adding %d service(s)", p_server_db->srv_num);
  for (uint8_t srvIdx = 0; srvIdx < p_server_db->srv_num; srvIdx++)
  {
    status = miapi_port_GattTblConvert((p_server_db->p_srv_db) + srvIdx);
  }

  mible_arch_evt_param_t param;
  param.srv_init_cmp.status = status;
  param.srv_init_cmp.p_gatts_db = p_server_db;
  mible_arch_event_callback(MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP, &param);
  return(MI_SUCCESS);
}

/**
 * @brief   Set characteristic value
 * @param   [in] srv_handle: service handle
 *          [in] value_handle: characteristic value handle
 *          [in] offset: the offset from which the attribute value has
 *to be updated
 *          [in] p_value: pointer to data
 *          [in] len: data length
 * @return  MI_SUCCESS             Successfully retrieved the value of the
 *attribute.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MIBLE_ERR_ATT_INVALID_ATT_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE  Attributes are not modifiable by
 *the application.
 * */
mible_status_t mible_gatts_value_set(uint16_t srv_handle,
        uint16_t value_handle, uint8_t offset, uint8_t* p_value, uint8_t len)
{
  qCharValueRec_t *pChar;
  qServiceRec_t *pService;

  MIBLE_PORT_ASSERT(p_value);

  //MIBLE_PORT_DBG3("Set Char Value, handle: %d , offset: %d, len: %d ", value_handle, offset, len);

  pService = miapi_port_GattTblFindServiceByHandle(srv_handle);
  if(!pService)
  {
    MIBLE_PORT_LOG_WAR1("service not found: %d", srv_handle);
    return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
  }

  pChar = miapi_port_GattTblFindCharValueByHandle(pService, value_handle);
  if(!pChar)
  {
    // It is possible that an attribute other than a characteristic value is modify.
    // However, the function explicitly indicate that this function is only to set characteristic value.
    MIBLE_PORT_ASSERT(pChar);
    MIBLE_PORT_LOG_WAR0("Characteristic Value not found");
    return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
  }

  if (len > pChar->maxLen)
  {
    MIBLE_PORT_LOG_WAR1("Wrong len, bigger than Char Value defined length: %d", pChar->maxLen);
    return(MI_ERR_INVALID_LENGTH);
  }

  if ((len+offset) > pChar->maxLen)
  {
    MIBLE_PORT_LOG_WAR1("Wrong combination of len and offset, bigger than Char Value defined length: %d", pChar->maxLen);
    return(MI_ERR_INVALID_PARAM);
  }

  if(pChar->flag.is_variable_len)
  {
    pChar->len = offset + len;
  }
  // Now set the value.
  memcpy(pChar->pAttr->pValue + offset, p_value, len);
  //MIBLE_PORT_DBG0("Char Value updated");
  return(MI_SUCCESS);
}

/**
 * @brief   Get characteristic value as a GATTS.
 * @param   [in] srv_handle: service handle
 *          [in] value_handle: characteristic value handle
 *          [out] p_value: pointer to data which stores characteristic value
 *          [out] p_len: pointer to data length.
 * @return  MI_SUCCESS             Successfully get the value of the attribute.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 **/
mible_status_t mible_gatts_value_get(uint16_t srv_handle,
        uint16_t value_handle, uint8_t* p_value, uint8_t *p_len)
{
  qCharValueRec_t *pChar;
  qServiceRec_t *pService;

  MIBLE_PORT_ASSERT(p_len);
  //MIBLE_PORT_DBG1("Get Char Value, handle: %d", value_handle);

  pService = miapi_port_GattTblFindServiceByHandle(srv_handle);
  if(!pService)
  {
    MIBLE_PORT_LOG_WAR1("service not found: %d", srv_handle);
    return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
  }

  pChar = miapi_port_GattTblFindCharValueByHandle(pService, value_handle);
  MIBLE_PORT_ASSERT(pChar);
  if(!pChar)
  {
    // It is possible that an attribute other than a characteristic value is modify.
    // However, the function explicitly indicate that this function is only to set characteristic value.
    MIBLE_PORT_LOG_WAR0("Characteristic Value not found");
    return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
  }

  // The Value will be set only if p_value is not NULL.
  // If p_value is NULL, only the lenght of the characteristic will be set.
  // This allows to get the length of the characteristic value without knowing it in advance.
  if(p_value)
  {
      // Now set the value.
      memcpy(p_value, pChar->pAttr->pValue, pChar->len);
  }
  *p_len = pChar->len;
  //MIBLE_PORT_DBG0("Char Value retrieved");
  return MI_SUCCESS;
}

/**
 * @brief   Set characteristic value and notify it to client.
 * @param   [in] conn_handle: conn handle
 *          [in] srv_handle: service handle
 *          [in] char_value_handle: characteristic  value handle
 *          [in] offset: the offset from which the attribute value has to
 * be updated
 *          [in] p_value: pointer to data
 *          [in] len: data length
 *          [in] type : notification = 1; indication = 2;
 *
 * @return  MI_SUCCESS             Successfully queued a notification or
 * indication for transmission,
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State or notifications
 * and/or indications not enabled in the CCCD.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE   //Attributes are not modifiable by
 * the application.
 * @note    This function checks for the relevant Client Characteristic
 * Configuration descriptor value to verify that the relevant operation (notification or
 * indication) has been enabled by the client.
 * */
mible_status_t mible_gatts_notify_or_indicate(uint16_t conn_handle,
        uint16_t srv_handle, uint16_t char_value_handle, uint8_t offset,
        uint8_t* p_value, uint8_t len, uint8_t type)
{
  qCharValueRec_t *pChar;
  qServiceRec_t *pService;
  uint8_t status;
  uint16_t CCCValue;
  MIBLE_PORT_DBG3("Ind/Notif: Conn: %d, Hdl: %d, type: %d", conn_handle, char_value_handle, type);
  MIBLE_PORT_ASSERT(p_value);
  
  status = mible_gatts_value_set(srv_handle, char_value_handle, offset, p_value, len);
  MIBLE_PORT_ASSERT(status == MI_SUCCESS);

  pService = miapi_port_GattTblFindServiceByHandle(srv_handle);
  if(!pService)
  {
    MIBLE_PORT_LOG_WAR1("service not found: %d", srv_handle);
    return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
  }
  pChar = miapi_port_GattTblFindCharValueByHandle(pService, char_value_handle);
  if(!pChar)
  {
    // It is possible that an attribute other than a characteristic value is modify.
    // However, the function explicitly indicate that this function is only to set
    // characteristic value (so NOT other attribute value).
    MIBLE_PORT_ASSERT(pChar);
    MIBLE_PORT_LOG_WAR0("Characteristic Value not found");
    return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
  }

  CCCValue  = GATTServApp_ReadCharCfg(conn_handle, GATT_CCC_TBL(pChar->pCCCValue));

  if (CCCValue != GATT_CFG_NO_OPERATION)
  {
    //if (CharAttrib != NULL)
    {
      if ( !( (CCCValue & GATT_CLIENT_CFG_NOTIFY ) && (type == 1)) &&
           !( (CCCValue & GATT_CLIENT_CFG_INDICATE) && (type == 2)))
      {
        MIBLE_PORT_LOG_WAR1("Ind/Notif of type: %d is not enable for this characteristic value", type);
        return(MI_ERR_INVALID_STATE);
      }
      miapi_port_SendNotiInd(conn_handle, type, pChar->pAttr, miapi_port_ReadAttrCB);
    }
  }
  else
  {
    MIBLE_PORT_LOG_WAR0("neither Indication or notification enable for this characteristic value");
    return(MI_ERR_INVALID_STATE);
  }

