MiEcosystem/mijia_ble_api/cc26xx_api.c
  MIBLE_PORT_DBG1("Ind/Notif: sent with status: %d", status);
  return(miapi_port_translateError(status));
}

/**
 * @brief   Respond to a Read/Write user authorization request.
 * @param   [in] conn_handle: conn handle
 *          [in] status:  1: permit to change value ; 0: reject to change value 
 *          [in] char_value_handle: characteristic handle
 *          [in] offset: the offset from which the attribute value has to
 * be updated
 *          [in] p_value: Pointer to new value used to update the attribute value.
 *          [in] len: data length
 *          [in] type : read response = 1; write response = 2;
 *
 * @return  MI_SUCCESS             Successfully queued a response to the peer, and in the case of a write operation, GATT updated.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State or no authorization request pending.
 *          MI_ERR_INVALID_LENGTH  Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_ATT_INVALID_ATT_HANDLE     Attribute not found.
 * @note    This call should only be used as a response to a MIBLE_GATTS_EVT_READ/WRITE_PERMIT_REQ
 * event issued to the application.
 * */
mible_status_t mible_gatts_rw_auth_reply(uint16_t conn_handle,
        uint8_t status, uint16_t char_value_handle, uint8_t offset,
        uint8_t* p_value, uint8_t len, uint8_t type)
{
  mible_status_t res;
  MIBLE_PORT_DBG4("Conn: %d, status: %d, char hdl: %d, type: %d", conn_handle, status, char_value_handle, type);

  if((port_object.ATTop.flag.validity) && (port_object.ATTop.flag.authorNeeded))
  {
    if(status == 0)
    {
      attErrorRsp_t attRsp;
      attRsp.reqOpcode = port_object.ATTop.method;
      attRsp.handle = port_object.ATTop.pAttr->handle;
      attRsp.errCode = (type == 1)?ATT_ERR_READ_NOT_PERMITTED:ATT_ERR_WRITE_NOT_PERMITTED;
      ATT_ErrorRsp(port_object.ATTop.connHandle, &attRsp);
      port_object.ATTop.flag.validity = 0;
      return(MI_SUCCESS);
    }
    else
    {
        uint16_t srvHdl = miapi_port_GattTblFindServiceHdleByCharHandle(char_value_handle);
        MIBLE_PORT_ASSERT(srvHdl);
        if(!srvHdl) return(MIBLE_ERR_ATT_INVALID_ATT_HANDLE);
        if(!p_value) return(MI_ERR_INVALID_ADDR);

        port_object.ATTop.flag.authorNeeded = 0;
        port_object.ATTop.flag.validity = 0;
        res = mible_gatts_value_set(srvHdl, char_value_handle, offset, p_value, len); 
        if (res != MI_SUCCESS)
        {
            MIBLE_PORT_DBG1("Failed to set the new value, status: %d", res);
            return(res);
        }

        switch(port_object.ATTop.method)
        {
          case ATT_READ_REQ:
          {
            attReadRsp_t rsp;
            uint16_t datasize;
            uint8_t char_len;

            // The length of the characteristic needs to be retrieved, since the length provided correspond
            // to a modification of the characteristic (offset can be different than 0), and not necessarily to the full length of the characteristic.
            mible_gatts_value_get(srvHdl, char_value_handle, NULL, &char_len);

            datasize = (char_len > port_object.ATTop.maxLen)?port_object.ATTop.maxLen:char_len;
            rsp.pValue = (uint8_t *)GATT_bm_alloc(port_object.ATTop.connHandle,
                                                  ATT_READ_RSP,
                                                  datasize, NULL);
            if (rsp.pValue)
            {
              rsp.len = datasize;
              uint16_t charValueLen;

              bStatus_t status = miapi_port_ReadAttrValue(port_object.ATTop.pAttr, rsp.pValue, &charValueLen, port_object.ATTop.offset, port_object.ATTop.maxLen);
              MIBLE_PORT_ASSERT(status==SUCCESS);
              if (SUCCESS != status)
              {
                  MIBLE_PORT_LOG_WAR0("can't read the characteristic value");
                  GATT_bm_free((gattMsg_t *)rsp.pValue, ATT_READ_RSP);
                  return(MI_ERR_INVALID_PARAM);
              }
              if(ATT_ReadRsp(conn_handle , &rsp) != SUCCESS)
              {
                MIBLE_PORT_LOG_WAR0("not enough memory");
                GATT_bm_free((gattMsg_t *)rsp.pValue, ATT_READ_RSP);
                return(MI_ERR_NO_MEM);
              }
            }
            else
            {
              MIBLE_PORT_LOG_WAR0("not enough memory");
              return(MI_ERR_NO_MEM);
            }
            res = MI_SUCCESS;
          }
          break;
          case ATT_WRITE_REQ:
          {
            ATT_WriteRsp(conn_handle);
          }
          break;
          case ATT_READ_BLOB_REQ:
          // Read blob is reading N bytes from Offset O.
          // Offset Value needs to be taken into account!
          {
            attReadRsp_t rsp;
            uint16_t datasize;
            uint8_t char_len;

            // The length of the characteristic needs to be retrieved, since the length provided correspond
            // to a modification of the characteristic (offset can be different than 0), and not necessarily to the full length of the characteristic.
            // and Read Blob also can have an offset different than 0.
            mible_gatts_value_get(srvHdl, char_value_handle, NULL, &char_len);
            datasize = ((char_len-port_object.ATTop.offset) > port_object.ATTop.maxLen)?port_object.ATTop.maxLen:(char_len-port_object.ATTop.offset);
            rsp.pValue = (uint8_t *)GATT_bm_alloc(port_object.ATTop.connHandle,
                                                  ATT_READ_BLOB_RSP,
                                                  datasize, NULL);
            if (rsp.pValue)
            {
              rsp.len = datasize;
              uint16_t charValueLen;

              bStatus_t status = miapi_port_ReadAttrValue(port_object.ATTop.pAttr, rsp.pValue, &charValueLen, port_object.ATTop.offset, port_object.ATTop.maxLen);
              MIBLE_PORT_ASSERT(status==SUCCESS);
              if (SUCCESS != status)
              {
                  MIBLE_PORT_LOG_WAR0("can't read the characteristic value");
                  GATT_bm_free((gattMsg_t *)rsp.pValue, ATT_READ_BLOB_RSP);
                  return(MI_ERR_INVALID_PARAM);
              }
              if(ATT_ReadRsp(conn_handle , &rsp) != SUCCESS)
              {
                MIBLE_PORT_LOG_WAR0("not enough memory");
                GATT_bm_free((gattMsg_t *)rsp.pValue, ATT_READ_BLOB_RSP);
                return(MI_ERR_NO_MEM);
              }
            }
            else
            {
              MIBLE_PORT_LOG_WAR0("not enough memory");
              return(MI_ERR_NO_MEM);
            }
            res = MI_SUCCESS;
          }

          case ATT_READ_BY_TYPE_REQ:
#ifdef ATT_DELAYED_REQ
          {
            uint16_t datasize;
            uint8_t char_len;
            mible_gatts_value_get(srvHdl, char_value_handle, NULL, &char_len);
            datasize = ((char_len-port_object.ATTop.offset) > port_object.ATTop.maxLen)?port_object.ATTop.maxLen:(char_len-port_object.ATTop.offset);
            uint8_t *pValue = (uint8_t *)ICall_mallocLimited(char_len);
            if (pValue)
            {
              uint16_t charValueLen;
              bStatus_t status = miapi_port_ReadAttrValue(port_object.ATTop.pAttr, pValue, &charValueLen, port_object.ATTop.offset, port_object.ATTop.maxLen);
              MIBLE_PORT_ASSERT(status==SUCCESS);
              if (SUCCESS != status)
              {
                MIBLE_PORT_LOG_WAR0("can't read the characteristic value");
                // Pass delayed response from Application Processor to GATT
                // Server to build Read By Type Response
                ICall_free(pValue);
                return(MI_ERR_INVALID_PARAM);
              }
              GATTServApp_ReadRsp(conn_handle, datasize, datasize, port_object.ATTop.pAttr->handle);
              ICall_free(pValue);
            }
            else
            {
                MIBLE_PORT_LOG_WAR0("not enough memory");
                return(MI_ERR_NO_MEM);
            }
            res = MI_SUCCESS;
          }
          break;
#endif // ATT_DELAYED_REQ
          case ATT_EXECUTE_WRITE_REQ:
          case ATT_PREPARE_WRITE_REQ:
          case ATT_WRITE_CMD:
          case ATT_SIGNED_WRITE_CMD:
          default:
              MIBLE_PORT_LOG_WAR1("this method is not supported with authorization: %d", port_object.ATTop.method);
              res = MI_ERR_BUSY;
            break;
        }
    }
    MIBLE_PORT_DBG0("Done");
    return(res);
  }
  else
  {
    MIBLE_PORT_LOG_WAR0("Invalid State, no ATT request pending, or authorization not needed");
    return(MI_ERR_INVALID_STATE);
  }
}

/**
 *        GATT Client APIs
 */

/**
 * @brief   Discover primary service by service UUID.
 * @param   [in] conn_handle: connect handle
 *          [in] handle_range: search range for primary sevice
 *discovery procedure
 *          [in] p_srv_uuid: pointer to service uuid
 * @return  MI_SUCCESS             Successfully started or resumed the Primary
 *Service Discovery procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE  Invaild connection handle.
 * @note    The response is given through
 *MIBLE_GATTC_EVT_PRIMARY_SERVICE_DISCOVER_RESP event
 * */
mible_status_t mible_gattc_primary_service_discover_by_uuid(
        uint16_t conn_handle, mible_handle_range_t handle_range,
        mible_uuid_t* p_srv_uuid)
{
  // TODO GATT Client
  return(MI_SUCCESS);
}

/**
 * @brief   Discover characteristic by characteristic UUID.
 * @param   [in] conn_handle: connect handle
 *          [in] handle_range: search range for characteristic discovery
 * procedure
 *          [in] p_char_uuid: pointer to characteristic uuid
 * @return  MI_SUCCESS             Successfully started or resumed the
 * Characteristic Discovery procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note    The response is given through
 * MIBLE_GATTC_CHR_DISCOVER_BY_UUID_RESP event
 * */
mible_status_t mible_gattc_char_discover_by_uuid(uint16_t conn_handle,
        mible_handle_range_t handle_range, mible_uuid_t* p_char_uuid)
{
  // TODO GATT Client
  return(MI_SUCCESS);
}

/**
 * @brief   Discover characteristic client configuration descriptor
 * @param   [in] conn_handle: connection handle
 *          [in] handle_range: search range
 * @return  MI_SUCCESS             Successfully started Clien Config Descriptor
 * Discovery procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note    Maybe run the charicteristic descriptor discover procedure firstly,
 * then pick up the client configuration descriptor which att type is 0x2092
 *          The response is given through MIBLE_GATTC_CCCD_DISCOVER_RESP
 * event
 *          Only return the first cccd handle within the specified
 * range.
 * */
mible_status_t mible_gattc_clt_cfg_descriptor_discover(
        uint16_t conn_handle, mible_handle_range_t handle_range)
{
  // TODO GATT Client
  return(MI_SUCCESS);
}

/**
 * @brief   Read characteristic value by UUID
 * @param   [in] conn_handle: connnection handle
 *          [in] handle_range: search range
 *          [in] p_char_uuid: pointer to characteristic uuid
 * @return  MI_SUCCESS             Successfully started or resumed the Read
 * using Characteristic UUID procedure.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note    The response is given through
 * MIBLE_GATTC_EVT_READ_CHR_VALUE_BY_UUID_RESP event
 * */
mible_status_t mible_gattc_read_char_value_by_uuid(uint16_t conn_handle,
        mible_handle_range_t handle_range, mible_uuid_t *p_char_uuid)
{
  // TODO GATT Client
  return(MI_SUCCESS);
}

/**
 * @brief   Write value by handle with response
 * @param   [in] conn_handle: connection handle
 *          [in] handle: handle to the attribute to be written.
 *          [in] p_value: pointer to data
 *          [in] len: data length
 * @return  MI_SUCCESS             Successfully started the Write with response
 * procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note    The response is given through MIBLE_GATTC_EVT_WRITE_RESP event
 *
 * */
mible_status_t mible_gattc_write_with_rsp(uint16_t conn_handle,
        uint16_t att_handle, uint8_t* p_value, uint8_t len)
{
  // TODO GATT Client
  return(MI_SUCCESS);
}

/**
 * @brief   Write value by handle without response
 * @param   [in] conn_handle: connection handle
 *          [in] att_handle: handle to the attribute to be written.
 *          [in] p_value: pointer to data
 *          [in] len: data length
 * @return  MI_SUCCESS             Successfully started the Write Cmd procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE  Invaild connection handle.
 * @note    no response
 * */
mible_status_t mible_gattc_write_cmd(uint16_t conn_handle,
        uint16_t att_handle, uint8_t* p_value, uint8_t len)
{
  // TODO GATT Client
  return(MI_SUCCESS);
}

/**
 *        SOFT TIMER APIs
 */

/**
 * @brief   Create a timer.
 * @param   [out] p_timer_id: a pointer to timer id address which can uniquely identify the timer.
 *          [in] timeout_handler: a pointer to a function which can be
 * called when the timer expires.
 *          [in] mode: repeated or single shot.
 * @return  MI_SUCCESS             If the timer was successfully created.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *          MI_ERR_INVALID_STATE   timer module has not been initialized or the
 * timer is running.
 *          MI_ERR_NO_MEM          timer pool is full.
 *
 * */
mible_status_t mible_timer_create(void** p_timer_id,
        mible_timer_handler timeout_handler, mible_timer_mode mode)
{
  uint32_t period = 0;
  timer_t *timer;
  MIBLE_PORT_DBG2("mode: %d , handler: %p", mode, (uintptr_t) timeout_handler);

