MiEcosystem/mijia_ble_api/cc26xx_api.c
  if (mode == MIBLE_TIMER_REPEATED)
  {
    period = 1;        // set to a value different than 0 to indicate a periodic timer
  }
  
  MIBLE_PORT_LOG_HEAP();
  timer = (timer_t *)ICall_mallocLimited(sizeof(timer_t));
  MIBLE_PORT_LOG_HEAP();
  if (timer)
  {
    Util_constructClock(&timer->clock, (Clock_FuncPtr)miapi_port_timer_cb, 0, period, false, (uintptr_t) timer);
    *p_timer_id = timer;
    timer->cb = timeout_handler;
  }
  else
  {
    MIBLE_PORT_LOG_ERR0("create, no memory left");
    MIBLE_PORT_LOG_HEAP();
    MIBLE_PORT_ASSERT(timer);
    return(MI_ERR_NO_MEM);
  }
  MIBLE_PORT_DBG1("Created, %p",  (uintptr_t) *p_timer_id);
  return(MI_SUCCESS);
}

/**
 * @brief   Delete a timer.
 * @param   [in] timer_id: timer id
 * @return  MI_SUCCESS             If the timer was successfully deleted.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied..
 * */
 mible_status_t mible_timer_delete(void* timer_id)
{
  timer_t * timer = (timer_t *) timer_id;
  MIBLE_PORT_DBG1("delete, %p",  (uintptr_t) timer);
  if(timer == NULL)
  {
    MIBLE_PORT_LOG_WAR1("invalid object %p",  (uintptr_t) timer);
    return(MI_ERR_INVALID_PARAM);
  }
  Clock_destruct(&timer->clock);
  MIBLE_PORT_LOG_HEAP();
  if (timer)
  {
    ICall_free(timer);
  }
  MIBLE_PORT_LOG_HEAP();
  MIBLE_PORT_DBG1("%p  deleted",  (uintptr_t) timer);
  return(MI_SUCCESS);
}

/**
 * @brief   Start a timer.
 * @param   [in] timer_id: timer id
 *          [in] timeout_value: Number of milliseconds to time-out event
 * (minimum 10 ms).
 *          [in] p_context: parameters that can be passed to
 * timeout_handler
 *
 * @return  MI_SUCCESS             If the timer was successfully started.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *          MI_ERR_INVALID_STATE   If the application timer module has not been
 * initialized or the timer has not been created.
 *          MI_ERR_NO_MEM          If the timer operations queue was full.
 * @note    If the timer has already started, it will start counting again.
 * */
mible_status_t mible_timer_start(void* timer_id, uint32_t timeout_value,
        void* p_context)
{
  timer_t * timer = (timer_t*) timer_id;
  Clock_Handle timerHdl = Clock_handle(&timer->clock);
  uint32_t clockTicks;
  MIBLE_PORT_DBG3("start %p, timeout: %d  ms, context: %p",  (uintptr_t) timer, timeout_value, (uintptr_t) p_context);

  if((timer == NULL) || (timeout_value < 10))
  {
      MIBLE_PORT_LOG_WAR0("invalid param! ");
      return(MI_ERR_INVALID_PARAM);
  }

  Clock_stop(timerHdl);

  // Convert timeout in milliseconds to ticks.
  clockTicks = timeout_value * (1000 / Clock_tickPeriod);
  Clock_setTimeout(timerHdl, clockTicks);

  timer->arg = p_context;

  // check period to see whether it is a period or one-shot timer, and set corresponding value
  if(Clock_getPeriod(timerHdl))
  {
    Clock_setPeriod(timerHdl, clockTicks);
  }

  Clock_start(timerHdl);
  MIBLE_PORT_DBG1("%p started",  (uintptr_t) timer);
  return(MI_SUCCESS);
}

/**
 * @brief   Stop a timer.
 * @param   [in] timer_id: timer id
 * @return  MI_SUCCESS             If the timer was successfully stopped.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *
 * */
mible_status_t mible_timer_stop(void* timer_id)
{
  timer_t* timer = (timer_t*) timer_id;
  Clock_Handle timerHdl = Clock_handle(&timer->clock);
  MIBLE_PORT_DBG1("timer_id: %p  ",  (uintptr_t) timer);
  if(timer == NULL)
  {
    MIBLE_PORT_LOG_WAR1("invalid object %p  ",  (uintptr_t) timer);
    return(MI_ERR_INVALID_PARAM);
  }

  Clock_stop(timerHdl);
  MIBLE_PORT_DBG1("%p stopped",  (uintptr_t) timer);
  return(MI_SUCCESS);
}

/**
 *        NVM APIs
 */

/**
 * @brief   Create a record in flash 
 * @param   [in] record_id: identify a record in flash 
 *          [in] len: record length
 * @return  MI_SUCCESS              Create successfully.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 *allowed size.
 *          MI_ERR_NO_MEM,          Not enough flash memory to be assigned 
 *              
 * */
mible_status_t mible_record_create(uint16_t record_id, uint8_t len)
{
  NVINTF_itemID_t id;
  uint8_t dummy_buf[1];
  MIBLE_PORT_DBG2("creating record id: %d, len: %d", record_id, len);
#ifndef CC26X2
  if(record_id > 0x0F)
   {
       return MI_ERR_NO_MEM;
   }


   NV_bitfield |= (1 << record_id);
#endif // !CC26X2
  if((len == 0) || (len > MIBLE_NV_RECORD_MAX_SIZE))
  {
       return MI_ERR_INVALID_LENGTH;
  }
  id.systemID = MIBLE_SYSTEM;
  id.itemID = record_id;
  id.subID = 0;
  if (MI_SUCCESS != port_object.NVpfn.writeItem(id, len, dummy_buf))
  {
    MIBLE_PORT_LOG_WAR0("invalid parameter");
    return(MI_ERR_INVALID_PARAM);
  }
  MIBLE_PORT_DBG1("record id %d created", record_id);
  return(MI_SUCCESS);
}

/**
 * @brief   Delete a record in flash
 * @param   [in] record_id: identify a record in flash  
 * @return  MI_SUCCESS              Delete successfully. 
 *          MI_ERR_INVALID_PARAMS   Invalid record id supplied.
 * */
mible_status_t mible_record_delete(uint16_t record_id)
{
#ifdef CC26X2
  MIBLE_PORT_DBG1("deleting record id %d", record_id);
  NVINTF_itemID_t id;
  id.systemID = MIBLE_SYSTEM;
  id.itemID = record_id;
  id.subID = 0;
  if (MI_SUCCESS != port_object.NVpfn.deleteItem(id))
  {
    MIBLE_PORT_LOG_WAR0("invalid parameter");
    return(MI_ERR_INVALID_PARAM);
  }
  mible_arch_evt_param_t param;
  param.record.id = record_id;
  param.record.status = MI_SUCCESS;
  mible_arch_event_callback(MIBLE_ARCH_EVT_RECORD_DELETE, &param);
  MIBLE_PORT_DBG1("record id %d deleted", record_id);
  return(MI_SUCCESS);
#else
  MIBLE_PORT_DBG1("deleting record id %d", record_id);
  // Item cannot be deleted, but they can be re-used...
  // For chameleon, only Allow 16 Entries...
  if((NV_bitfield & (1 << record_id)) == 0)
  {
      return MI_ERR_INVALID_PARAM;
  }
  else
  {
      NV_bitfield &= ~(1 << record_id);
  }

  mible_arch_evt_param_t param;
  param.record.id = record_id;
  param.record.status = MI_SUCCESS;
  mible_arch_event_callback(MIBLE_ARCH_EVT_RECORD_DELETE, &param);
  MIBLE_PORT_DBG1("record id %d deleted", record_id);
  return(MI_SUCCESS);
#endif
}

/**
 * @brief   Restore data to flash
 * @param   [in] record_id: identify an area in flash
 *          [out] p_data: pointer to data
 *          [in] len: data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 *allowed size.
 *          MI_ERR_INVALID_PARAMS   Invalid record id supplied.
 *          MI_ERR_INVALID_ADDR     Invalid pointer supplied.
 * */
mible_status_t mible_record_read(uint16_t record_id, uint8_t *p_data,
        uint8_t len)
{
  NVINTF_itemID_t id;
  uint8_t res;
  MIBLE_PORT_DBG1("reading record id %d", record_id);
  MIBLE_PORT_ASSERT(p_data);

#ifndef CC26X2
  if(record_id > 0x0F)
  {
      return MI_ERR_INVALID_PARAM;
  }
#endif // !CC26x2
  id.systemID = MIBLE_SYSTEM;
  id.itemID = record_id;
  id.subID = 0;

  res = port_object.NVpfn.readItem(id, 0, len, p_data);
  if ((len == 0) || (res == NVINTF_BADLENGTH) || (len > MIBLE_NV_RECORD_MAX_SIZE))
  {
    MIBLE_PORT_LOG_WAR0("invalid length");
    return(MI_ERR_INVALID_LENGTH);
  }
  else if (res != MI_SUCCESS)
  {
    MIBLE_PORT_LOG_WAR2("fail to read record id %d, status: %d", record_id, res);
    return(MI_ERR_INVALID_ADDR);
  }
  MIBLE_PORT_DBG1("record id: %d  read", record_id);
  return(MI_SUCCESS);
}

/**
 * @brief   Store data to flash
 * @param   [in] record_id: identify an area in flash
 *          [in] p_data: pointer to data
 *          [in] len: data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 * allowed size.
 *          MI_ERR_INVALID_PARAMS   p_data is not aligned to a 4 byte boundary.
 * @note    Should use asynchronous mode to implement this function.
 *          The data to be written to flash has to be kept in memory until the
 * operation has terminated, i.e., an event is received.
 *          When record writing complete , call mible_arch_event_callback function and pass MIBLE_ARCH_EVT_RECORD_WRITE_CMP event and result. 
 * */
mible_status_t mible_record_write(uint16_t record_id, uint8_t* p_data,
        uint8_t len)
{
  NVINTF_itemID_t id;
  uint8_t res;

