MiEcosystem/mijia_ble_api/cc26xx_api.c
  MIBLE_PORT_DBG2("Writing record id: %d, len: %d", record_id, len);
  MIBLE_PORT_ASSERT(p_data);

#ifndef CC26X2
  if(record_id > 0x0F)
  {
      return MI_ERR_INVALID_PARAM;
  }
#endif // ! CC26X2

  id.systemID = MIBLE_SYSTEM;
  id.itemID = record_id;
  id.subID = 0;
  port_object.NVpfn.compactNV(len);
  res = port_object.NVpfn.writeItem(id, len, p_data);
  if ((len == 0) || (res == NVINTF_BADLENGTH) || (len > MIBLE_NV_RECORD_MAX_SIZE))
  {
    MIBLE_PORT_LOG_WAR0("invalid length");
    return(MI_ERR_INVALID_LENGTH);
  }
  else if (res != SUCCESS)
  {
      MIBLE_PORT_LOG_WAR2("fail to write record id %d, status: %d", record_id, res);
    return(MI_ERR_INVALID_PARAM);
  }
  port_object.NVpfn.compactNV(128);
  MIBLE_PORT_DBG1("recod id %d  written", record_id);
  mible_arch_evt_param_t param;
  param.record.id = record_id;
  param.record.status = MI_SUCCESS;
  mible_arch_event_callback(MIBLE_ARCH_EVT_RECORD_WRITE, &param);
  return(MI_SUCCESS);
}

/**
 *        MISC APIs
 */

/**
 * @brief   Get ture random bytes .
 * @param   [out] p_buf: pointer to data
 *          [in] len: Number of bytes to take from pool and place in
 * p_buff
 * @return  MI_SUCCESS          The requested bytes were written to
 * p_buff
 *          MI_ERR_NO_MEM       No bytes were written to the buffer, because
 * there were not enough random bytes available.
 * @note    SHOULD use TRUE random num generator
 * */
mible_status_t mible_rand_num_generator(uint8_t* p_buf, uint8_t len)
{
    uint32_t num = 0;
    uint8_t i;
    MIBLE_PORT_DBG1("len: %d", len);
    MIBLE_PORT_ASSERT(p_buf);

    for(i = 0; i < (len>>2); i++)
    {
        num = TRNGCC26XX_getNumber(NULL, NULL, NULL);
        *((uint32_t *)p_buf) = num;
    }

    if(len & 0x11)
    {
        num = TRNGCC26XX_getNumber(NULL, NULL, NULL);
        switch(len & 0x11)
        {
            case 1:
                *(p_buf + i * 4) = (uint8_t)(num);
                break;
            case 2:
                *(p_buf + i * 4)     = (uint8_t)(num >> 8);
                *(p_buf + i * 4 + 1) = (uint8_t)(num);
                break;
            case 3:
                *(p_buf + i * 4)     = (uint8_t)(num >> 16);
                *(p_buf + i * 4 + 1) = (uint8_t)(num >> 8);
                *(p_buf + i * 4 + 2) = (uint8_t)(num);
                break;
            default:
                break;
        }
    }
    MIBLE_PORT_DBG1("%d bytes generated", len);
    MIBLE_PORT_ASSERT(p_buf);
    return(MI_SUCCESS);
}

/**
 * @brief   Encrypts a block according to the specified parameters. 128-bit
 * AES encryption. (zero padding)
 * @param   [in] key: encryption key
 *          [in] plaintext: pointer to plain text
 *          [in] plen: plain text length
 *          [out] ciphertext: pointer to cipher text
 * @return  MI_SUCCESS              The encryption operation completed.
 *          MI_ERR_INVALID_ADDR     Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE    Encryption module is not initialized.
 *          MI_ERR_INVALID_LENGTH   Length bigger than 16.
 *          MI_ERR_BUSY             Encryption module already in progress.
 * @note    SHOULD use synchronous mode to implement this function
 * */
mible_status_t mible_aes128_encrypt(const uint8_t* key,
        const uint8_t* plaintext, uint8_t plen, uint8_t* ciphertext)
{
#ifdef CC26X2

    // data needed for TI crypto driver for AESECB
    AESECB_Handle    encHandleECB;
    AESECB_Params    encParamsECB;
    AESECB_Operation operationECB;
    CryptoKey        cryptoKey;
    uint32_t resEncrypt;

    MIBLE_PORT_DBG4("Key: [%d:%d:%d:%d...], ", key[0], key[1], key[2], key[3] );
    MIBLE_PORT_DBG2("Plain: Len: %d , [%d:...], ", plen, plaintext[0] );
    MIBLE_PORT_ASSERT(ciphertext);
    /* Initialize both AESCCM objects as BLE stack is using both */
    AESECB_init();

    AESECB_Params_init( &encParamsECB );
    encParamsECB.returnBehavior = AESECB_RETURN_BEHAVIOR_POLLING;
    encHandleECB = AESECB_open(0, &encParamsECB);
    MIBLE_PORT_ASSERT(encHandleECB);

    AESECB_Operation_init(&operationECB);

    CRITICAL_SECTION_ENTER();

    // The cryptoKey is initialized already, just update the key material
    //MAP_osal_memcpy(cryptoKey.u.plaintext.keyMaterial, key, ENC_KEY_LEN);
    CryptoKeyPlaintext_initKey(&cryptoKey, (uint8_t*) key, sizeof(key));
    operationECB.key               = &cryptoKey;
    operationECB.input             = (uint8_t*) plaintext;
    operationECB.output            = ciphertext;
    operationECB.inputLength       = plen;

    if((resEncrypt = AESECB_oneStepEncrypt(encHandleECB, &operationECB) != AESECB_STATUS_SUCCESS))
    {
        MIBLE_PORT_ASSERT(resEncrypt == AESECB_STATUS_SUCCESS);
    }
    CRITICAL_SECTION_EXIT();
#else // !CC26X2
	CryptoCC26XX_Handle             handle;
	int32_t                         keyIndex;
	CryptoCC26XX_AESECB_Transaction trans;
	
  MIBLE_PORT_DBG4("Key: [%d:%d:%d:%d...], ", key[0], key[1], key[2], key[3] );
  MIBLE_PORT_DBG2("Plain: Len: %d , [%d:...], ", plen, plaintext[0] );
  MIBLE_PORT_ASSERT(ciphertext);
	CryptoCC26XX_init();
	
	handle = CryptoCC26XX_open(Board_CRYPTO0, false, NULL);
		
	keyIndex = CryptoCC26XX_allocateKey(handle, CRYPTOCC26XX_KEY_ANY, (const uint32_t *) key);
		
  CRITICAL_SECTION_ENTER();
	CryptoCC26XX_Transac_init((CryptoCC26XX_Transaction *) &trans, CRYPTOCC26XX_OP_AES_ECB_ENCRYPT);
	
	trans.keyIndex         = keyIndex;
	trans.msgIn            = (uint8_t *) plaintext;
	trans.msgOut           = (uint8_t *) ciphertext;
	
	CryptoCC26XX_transact(handle, (CryptoCC26XX_Transaction *) &trans);
  
  CRITICAL_SECTION_EXIT();
	
	CryptoCC26XX_releaseKey(handle, &keyIndex);
	
	CryptoCC26XX_close(handle);

#endif // CC26X2

  MIBLE_PORT_DBG1("ciphertext: [%d:...], ", ciphertext[0] );
  return(MI_SUCCESS);

}
/**
 * @brief   Post a task to a task quene, which can be executed in a right place 
 * (maybe a task in RTOS or while(1) in the main function).
 * @param   [in] handler: a pointer to function 
 *          [in] param: function parameters 
 * @return  MI_SUCCESS              Successfully put the handler to quene.
 *          MI_ERR_NO_MEM           The task quene is full. 
 *          MI_ERR_INVALID_PARAM    Handler is NULL
 * */
mible_status_t mible_task_post(mible_handler_t handler, void *arg)
{
  qTaskRec_t *pRec;
  // Add Job to the list...
  // Allocated space for queue node.
  if ((pRec = (qTaskRec_t *)ICall_mallocLimited(sizeof(qTaskRec_t))))
  {
    pRec->handler = handler;
    pRec->arg = arg;

